nxp-appcodehub/dm-power-delivery-frdm-a-s32k344/src/drivers/inc/fs26_map.h
/*==================================================================================================
 * Project : RTD AUTOSAR 4.9
 * Platform : CORTEXM
 * Peripheral : S32K3XX
 * Dependencies : none
 *
 * Autosar Version : 4.9.0
 * Autosar Revision : ASR_REL_4_9_REV_0000
 * Autosar Conf.Variant :
 * SW Version : 7.0.0
 * Build Version : S32K3_RTD_7_0_0_QLP03_D2512_ASR_REL_4_9_REV_0000_20251210
 *
 * Copyright 2020 - 2026 NXP
 *
 *   NXP Proprietary. This software is owned or controlled by NXP and may only be
 *   used strictly in accordance with the applicable license terms. By expressly
 *   accepting such terms or by downloading, installing, activating and/or otherwise
 *   using the software, you are agreeing that you have read, and that you agree to
 *   comply with and are bound by, such license terms. If you do not agree to be
 *   bound by the applicable license terms, then you may not retain, install,
 *   activate or otherwise use the software.
==================================================================================================*/

#ifndef DRIVERS_FS26_FS26_MAP_H_
#define DRIVERS_FS26_FS26_MAP_H_

/******************************************************************************/
/* M_DEVICEID - Type: R                                                       */
/******************************************************************************/
#define FS26_M_DEVICEID_ADDR             0x00U
#define FS26_M_DEVICEID_DEFAULT          0x01C0U

/* Device ID */
#define FS26_M_DEV_ID_MASK               0x003FU
#define FS26_M_DEV_ID_SHIFT              0x0000U
/* Device Family Identification */
#define FS26_M_FAM_ID_MASK               0x03C0U
#define FS26_M_FAM_ID_SHIFT              0x0006U
/* Metal Mask revision */
#define FS26_M_METAL_LAYER_REV_MASK      0x1C00U
#define FS26_M_METAL_LAYER_REV_SHIFT     0x0010U
/* Full Layer Mask revision */
#define FS26_M_FULL_LAYER_REV_MASK       0xE000U
#define FS26_M_FULL_LAYER_REV_SHIFT      0x0013U

/* Reserved */
#define FS26_M_FAM_ID_RES_0              (0x0000U << FS26_M_FAM_ID_SHIFT)
/* Reserved */
#define FS26_M_FAM_ID_RES_1              (0x0001U << FS26_M_FAM_ID_SHIFT)
/* Reserved */
#define FS26_M_FAM_ID_RES_2              (0x0002U << FS26_M_FAM_ID_SHIFT)
/* Reserved */
#define FS26_M_FAM_ID_RES_3              (0x0003U << FS26_M_FAM_ID_SHIFT)
/* Reserved */
#define FS26_M_FAM_ID_RES_4              (0x0004U << FS26_M_FAM_ID_SHIFT)
/* Reserved */
#define FS26_M_FAM_ID_RES_5              (0x0005U << FS26_M_FAM_ID_SHIFT)
/* Reserved */
#define FS26_M_FAM_ID_RES_6              (0x0006U << FS26_M_FAM_ID_SHIFT)
/* FS26 family */
#define FS26_M_FAM_ID_FS26               (0x0007U << FS26_M_FAM_ID_SHIFT)
/* Reserved */
#define FS26_M_FAM_ID_RES_8              (0x0008U << FS26_M_FAM_ID_SHIFT)
/* Reserved */
#define FS26_M_FAM_ID_RES_9              (0x0009U << FS26_M_FAM_ID_SHIFT)
/* Reserved */
#define FS26_M_FAM_ID_RES_10             (0x000AU << FS26_M_FAM_ID_SHIFT)
/* Reserved */
#define FS26_M_FAM_ID_RES_11             (0x000BU << FS26_M_FAM_ID_SHIFT)
/* Reserved */
#define FS26_M_FAM_ID_RES_12             (0x000CU << FS26_M_FAM_ID_SHIFT)
/* Reserved */
#define FS26_M_FAM_ID_RES_13             (0x000DU << FS26_M_FAM_ID_SHIFT)
/* Reserved */
#define FS26_M_FAM_ID_RES_14             (0x000EU << FS26_M_FAM_ID_SHIFT)
/* Reserved */
#define FS26_M_FAM_ID_RES_15             (0x000FU << FS26_M_FAM_ID_SHIFT)

/* Rev X.0 ( Default full Layer revision) */
#define FS26_M_METAL_LAYER_REV_0         (0x0000U << FS26_M_METAL_LAYER_REV_SHIFT)
/* Rev X.1 */
#define FS26_M_METAL_LAYER_REV_1         (0x0001U << FS26_M_METAL_LAYER_REV_SHIFT)
/* Rev X.2 */
#define FS26_M_METAL_LAYER_REV_2         (0x0002U << FS26_M_METAL_LAYER_REV_SHIFT)
/* Rev X.3 */
#define FS26_M_METAL_LAYER_REV_3         (0x0003U << FS26_M_METAL_LAYER_REV_SHIFT)
/* Rev X.4 */
#define FS26_M_METAL_LAYER_REV_4         (0x0004U << FS26_M_METAL_LAYER_REV_SHIFT)
/* Rev X.5 */
#define FS26_M_METAL_LAYER_REV_5         (0x0005U << FS26_M_METAL_LAYER_REV_SHIFT)
/* Rev X.6 */
#define FS26_M_METAL_LAYER_REV_6         (0x0006U << FS26_M_METAL_LAYER_REV_SHIFT)
/* Rev X.7 */
#define FS26_M_METAL_LAYER_REV_7         (0x0007U << FS26_M_METAL_LAYER_REV_SHIFT)

/* Unused */
#define FS26_M_FULL_LAYER_REV_UNUSED     (0x0000U << FS26_M_FULL_LAYER_REV_SHIFT)
/* Pass A silicon */
#define FS26_M_FULL_LAYER_REV_A          (0x0001U << FS26_M_FULL_LAYER_REV_SHIFT)
/* Pass B silicon */
#define FS26_M_FULL_LAYER_REV_B          (0x0002U << FS26_M_FULL_LAYER_REV_SHIFT)
/* Pass C silicon */
#define FS26_M_FULL_LAYER_REV_C          (0x0003U << FS26_M_FULL_LAYER_REV_SHIFT)
/* Pass D silicon */
#define FS26_M_FULL_LAYER_REV_D          (0x0004U << FS26_M_FULL_LAYER_REV_SHIFT)
/* Pass E silicon */
#define FS26_M_FULL_LAYER_REV_E          (0x0005U << FS26_M_FULL_LAYER_REV_SHIFT)
/* Pass F silicon */
#define FS26_M_FULL_LAYER_REV_F          (0x0006U << FS26_M_FULL_LAYER_REV_SHIFT)
/* Pass G silicon */
#define FS26_M_FULL_LAYER_REV_G          (0x0007U << FS26_M_FULL_LAYER_REV_SHIFT)

/******************************************************************************/
/* M_PROGID - Type: R                                                         */
/******************************************************************************/
#define FS26_M_PROGID_ADDR               0x01U
#define FS26_M_PROGID_DEFAULT            0x00C0U

/* Lower byte to set the second letter for OTP ID code (A-Z) */
#define FS26_M_PROG_IDL_MASK             0x00FFU
#define FS26_M_PROG_IDL_SHIFT            0x0000U
/* Higher byte to set the first letter for the OTP ID code (A-Z) */
#define FS26_M_PROG_IDH_MASK             0xFF00U
#define FS26_M_PROG_IDH_SHIFT            0x0008U

/******************************************************************************/
/* M_STATUS - Type: R                                                         */
/******************************************************************************/
#define FS26_M_STATUS_ADDR               0x02U
#define FS26_M_STATUS_DEFAULT            0x0000U

/* Real time Status of LDO1 Regulator */
#define FS26_M_LDO1_S_MASK               0x0001U
#define FS26_M_LDO1_S_SHIFT              0x0000U
/* Real time status of LDO2 Regulator */
#define FS26_M_LDO2_S_MASK               0x0002U
#define FS26_M_LDO2_S_SHIFT              0x0001U
/* Real time status of VCORE Regulator */
#define FS26_M_CORE_S_MASK               0x0004U
#define FS26_M_CORE_S_SHIFT              0x0002U
/* Real time status of TRK1 Regulator */
#define FS26_M_TRK1_S_MASK               0x0008U
#define FS26_M_TRK1_S_SHIFT              0x0003U
/* Real time status of TRK2 Regulator */
#define FS26_M_TRK2_S_MASK               0x0010U
#define FS26_M_TRK2_S_SHIFT              0x0004U
/* Real time status of VPRE Regulator */
#define FS26_M_VPRE_S_MASK               0x0020U
#define FS26_M_VPRE_S_SHIFT              0x0005U
/* Real time status of VBST Regulator */
#define FS26_M_VBST_S_MASK               0x0040U
#define FS26_M_VBST_S_SHIFT              0x0006U
/* Real time status of VREF Regulator */
#define FS26_M_VREF_S_MASK               0x0080U
#define FS26_M_VREF_S_SHIFT              0x0007U
/* GPIO1 pin status */
#define FS26_M_IO1_S_MASK                0x0100U
#define FS26_M_IO1_S_SHIFT               0x0008U
/* GPIO2 pin status */
#define FS26_M_IO2_S_MASK                0x0200U
#define FS26_M_IO2_S_SHIFT               0x0009U
/* Real time status of WAKE1 pin */
#define FS26_M_WK1_S_MASK                0x0400U
#define FS26_M_WK1_S_SHIFT               0x000AU
/* Real time status of WAKE2 pin */
#define FS26_M_WK2_S_MASK                0x0800U
#define FS26_M_WK2_S_SHIFT               0x000BU
/* Real time status of VBST FB pin */
#define FS26_M_VBSTFB_UV_S_MASK          0x1000U
#define FS26_M_VBSTFB_UV_S_SHIFT         0x000CU
/* Real time status of VBST switching status */
#define FS26_M_VBSTFB_ACTIVE_S_MASK      0x2000U
#define FS26_M_VBSTFB_ACTIVE_S_SHIFT     0x000DU
/* Real time status of Thermal Warning flag */
#define FS26_M_TWARN_S_MASK              0x8000U
#define FS26_M_TWARN_S_SHIFT             0x000FU

/* LDO1 is Disabled */
#define FS26_M_LDO1_S_DISABLED           (0x0000U << FS26_M_LDO1_S_SHIFT)
/* LDO1 is Enabled */
#define FS26_M_LDO1_S_ENABLED            (0x0001U << FS26_M_LDO1_S_SHIFT)

/* LDO2 is Disabled */
#define FS26_M_LDO2_S_DISABLED           (0x0000U << FS26_M_LDO2_S_SHIFT)
/* LDO2 is Enabled */
#define FS26_M_LDO2_S_ENABLED            (0x0001U << FS26_M_LDO2_S_SHIFT)

