nxp-appcodehub/dm-power-delivery-frdm-a-s32k344/src/drivers/inc/fs26_map.h
/* VCORE is Disabled */
#define FS26_M_CORE_S_DISABLED           (0x0000U << FS26_M_CORE_S_SHIFT)
/* VCORE is Enabled */
#define FS26_M_CORE_S_ENABLED            (0x0001U << FS26_M_CORE_S_SHIFT)

/* TRK1 is Disabled */
#define FS26_M_TRK1_S_DISABLED           (0x0000U << FS26_M_TRK1_S_SHIFT)
/* TRK1 is Enabled */
#define FS26_M_TRK1_S_ENABLED            (0x0001U << FS26_M_TRK1_S_SHIFT)

/* TRK2 is Disabled */
#define FS26_M_TRK2_S_DISABLED           (0x0000U << FS26_M_TRK2_S_SHIFT)
/* TRK2 is Enabled */
#define FS26_M_TRK2_S_ENABLED            (0x0001U << FS26_M_TRK2_S_SHIFT)

/* VPRE is Disabled */
#define FS26_M_VPRE_S_DISABLED           (0x0000U << FS26_M_VPRE_S_SHIFT)
/* VPRE is Enabled */
#define FS26_M_VPRE_S_ENABLED            (0x0001U << FS26_M_VPRE_S_SHIFT)

/* VBST is Disabled or not switching (Pass through mode) */
#define FS26_M_VBST_S_DISABLED           (0x0000U << FS26_M_VBST_S_SHIFT)
/* VBST is Enabled */
#define FS26_M_VBST_S_ENABLED            (0x0001U << FS26_M_VBST_S_SHIFT)

/* VREF is Disabled */
#define FS26_M_VREF_S_DISABLED           (0x0000U << FS26_M_VREF_S_SHIFT)
/* VREF is Enabled */
#define FS26_M_VREF_S_ENABLED            (0x0001U << FS26_M_VREF_S_SHIFT)

/* GPIO1 is low */
#define FS26_M_IO1_S_LOW                 (0x0000U << FS26_M_IO1_S_SHIFT)
/* GPIO1 is high */
#define FS26_M_IO1_S_HIGH                (0x0001U << FS26_M_IO1_S_SHIFT)

/* GPIO2 is low */
#define FS26_M_IO2_S_LOW                 (0x0000U << FS26_M_IO2_S_SHIFT)
/* GPIO2 is high */
#define FS26_M_IO2_S_HIGH                (0x0001U << FS26_M_IO2_S_SHIFT)

/* WAKE1 is low */
#define FS26_M_WK1_S_LOW                 (0x0000U << FS26_M_WK1_S_SHIFT)
/* WAKE1 is high */
#define FS26_M_WK1_S_HIGH                (0x0001U << FS26_M_WK1_S_SHIFT)

/* WAKE2 is low */
#define FS26_M_WK2_S_LOW                 (0x0000U << FS26_M_WK2_S_SHIFT)
/* WAKE2 is high */
#define FS26_M_WK2_S_HIGH                (0x0001U << FS26_M_WK2_S_SHIFT)

/* VSBT_FB below VBST_UV_TH */
#define FS26_M_VBSTFB_UV_S_BELOW         (0x0000U << FS26_M_VBSTFB_UV_S_SHIFT)
/* VSBT_FB above VBST_UV_TH */
#define FS26_M_VBSTFB_UV_S_ABOVE         (0x0001U << FS26_M_VBSTFB_UV_S_SHIFT)

/* VBST LX node is not switching */
#define FS26_M_VBSTFB_ACTIVE_S_BELOW     (0x0000U << FS26_M_VBSTFB_ACTIVE_S_SHIFT)
/* VBST LX node is switching */
#define FS26_M_VBSTFB_ACTIVE_S_ABOVE     (0x0001U << FS26_M_VBSTFB_ACTIVE_S_SHIFT)

/* TJ is below TWARN threshold */
#define FS26_M_TWARN_S_BELOW             (0x0000U << FS26_M_TWARN_S_SHIFT)
/* TJ is above TWARN threshold */
#define FS26_M_TWARN_S_ABOVE             (0x0001U << FS26_M_TWARN_S_SHIFT)

/******************************************************************************/
/* M_TSD_FLG - Type: RW                                                       */
/******************************************************************************/
#define FS26_M_TSD_FLG_ADDR              0x03U
#define FS26_M_TSD_FLG_DEFAULT           0x0000U

/* Interrupt flag when LDO1 Thermal shutdown event occurs */
#define FS26_M_LDO1TSD_I_MASK            0x0001U
#define FS26_M_LDO1TSD_I_SHIFT           0x0000U
/* Interrupt flag when LDO2 Thermal shutdown event occurs */
#define FS26_M_LDO2TSD_I_MASK            0x0002U
#define FS26_M_LDO2TSD_I_SHIFT           0x0001U
/* Interrupt flag when VCORE Thermal shutdown event occurs */
#define FS26_M_CORETSD_I_MASK            0x0004U
#define FS26_M_CORETSD_I_SHIFT           0x0002U
/* Interrupt flag when TRK1 Thermal shutdown event occurs */
#define FS26_M_TRK1TSD_I_MASK            0x0008U
#define FS26_M_TRK1TSD_I_SHIFT           0x0003U
/* Interrupt flag when TRK2 Thermal shutdown event occurs */
#define FS26_M_TRK2TSD_I_MASK            0x0010U
#define FS26_M_TRK2TSD_I_SHIFT           0x0004U
/* Interrupt flag when VPRE Thermal shutdown event occurs */
#define FS26_M_VPRETSD_I_MASK            0x0020U
#define FS26_M_VPRETSD_I_SHIFT           0x0005U
/* Interrupt flag when GPIO1 Thermal shutdown event occurs */
#define FS26_M_IO1TSD_I_MASK             0x0040U
#define FS26_M_IO1TSD_I_SHIFT            0x0006U
/* Central Temp sensor has crossed the Thermal warning threshold on the rising edge */
#define FS26_M_TWARN_I_MASK              0x8000U
#define FS26_M_TWARN_I_SHIFT             0x000FU

/* No Thermal Shutdown event detected */
#define FS26_M_LDO1TSD_I_NO_EVENT        (0x0000U << FS26_M_LDO1TSD_I_SHIFT)
/* Thermal Shutdown event occurred */
#define FS26_M_LDO1TSD_I_EVENT           (0x0001U << FS26_M_LDO1TSD_I_SHIFT)

/* No Thermal Shutdown event detected */
#define FS26_M_LDO2TSD_I_NO_EVENT        (0x0000U << FS26_M_LDO2TSD_I_SHIFT)
/* Thermal Shutdown event occurred */
#define FS26_M_LDO2TSD_I_EVENT           (0x0001U << FS26_M_LDO2TSD_I_SHIFT)

/* No Thermal Shutdown event detected */
#define FS26_M_CORETSD_I_NO_EVENT        (0x0000U << FS26_M_CORETSD_I_SHIFT)
/* Thermal Shutdown event occurred */
#define FS26_M_CORETSD_I_EVENT           (0x0001U << FS26_M_CORETSD_I_SHIFT)

/* No Thermal Shutdown event detected */
#define FS26_M_TRK1TSD_I_NO_EVENT        (0x0000U << FS26_M_TRK1TSD_I_SHIFT)
/* Thermal Shutdown event occurred */
#define FS26_M_TRK1TSD_I_EVENT           (0x0001U << FS26_M_TRK1TSD_I_SHIFT)

/* No Thermal Shutdown event detected */
#define FS26_M_TRK2TSD_I_NO_EVENT        (0x0000U << FS26_M_TRK2TSD_I_SHIFT)
/* Thermal Shutdown event occurred */
#define FS26_M_TRK2TSD_I_EVENT           (0x0001U << FS26_M_TRK2TSD_I_SHIFT)

/* No Thermal Shutdown event detected */
#define FS26_M_VPRETSD_I_NO_EVENT        (0x0000U << FS26_M_VPRETSD_I_SHIFT)
/* Thermal Shutdown event occurred */
#define FS26_M_VPRETSD_I_EVENT           (0x0001U << FS26_M_VPRETSD_I_SHIFT)

/* No Thermal Shutdown event detected */
#define FS26_M_IO1TSD_I_NO_EVENT         (0x0000U << FS26_M_IO1TSD_I_SHIFT)
/* Thermal Shutdown event occurred */
#define FS26_M_IO1TSD_I_EVENT            (0x0001U << FS26_M_IO1TSD_I_SHIFT)

/* No Thermal warning detected */
#define FS26_M_TWARN_I_NO_WARNING        (0x0000U << FS26_M_TWARN_I_SHIFT)
/* Thermal warning occurred */
#define FS26_M_TWARN_I_WARNING           (0x0001U << FS26_M_TWARN_I_SHIFT)

/******************************************************************************/
/* M_TSD_MSK - Type: RW                                                       */
/******************************************************************************/
#define FS26_M_TSD_MSK_ADDR              0x04U
#define FS26_M_TSD_MSK_DEFAULT           0x0000U

