nxp-appcodehub/dm-power-delivery-frdm-a-s32k344/src/drivers/inc/fs26_map.h
/* Inhibit Interrupt when LDO1 Thermal Shutdown occurs */
#define FS26_M_LDO1TSD_M_MASK            0x0001U
#define FS26_M_LDO1TSD_M_SHIFT           0x0000U
/* Inhibit Interrupt when LDO2 Thermal Shutdown occurs */
#define FS26_M_LDO2TSD_M_MASK            0x0002U
#define FS26_M_LDO2TSD_M_SHIFT           0x0001U
/* Inhibit Interrupt when VCORE Thermal Shutdown occurs */
#define FS26_M_CORETSD_M_MASK            0x0004U
#define FS26_M_CORETSD_M_SHIFT           0x0002U
/* Inhibit Interrupt when TRK1 Thermal Shutdown occurs */
#define FS26_M_TRK1TSD_M_MASK            0x0008U
#define FS26_M_TRK1TSD_M_SHIFT           0x0003U
/* Inhibit Interrupt when TRK2 Thermal Shutdown occurs */
#define FS26_M_TRK2TSD_M_MASK            0x0010U
#define FS26_M_TRK2TSD_M_SHIFT           0x0004U
/* Inhibit Interrupt when VPRE Thermal Shutdown occurs */
#define FS26_M_VPRETSD_M_MASK            0x0020U
#define FS26_M_VPRETSD_M_SHIFT           0x0005U
/* Inhibit Interrupt when GPIO1 Thermal Shutdown occurs */
#define FS26_M_IO1TSD_M_MASK             0x0040U
#define FS26_M_IO1TSD_M_SHIFT            0x0006U
/* Inhibit Interrupt when a Thermal warning occurs */
#define FS26_M_TWARN_M_MASK              0x8000U
#define FS26_M_TWARN_M_SHIFT             0x000FU

/* Interrupt MASKED */
#define FS26_M_LDO1TSD_M_MASKED          (0x0000U << FS26_M_LDO1TSD_M_SHIFT)
/* Interrupt NOT MASKED */
#define FS26_M_LDO1TSD_M_NOT_MASKED      (0x0001U << FS26_M_LDO1TSD_M_SHIFT)

/* Interrupt MASKED */
#define FS26_M_LDO2TSD_M_MASKED          (0x0000U << FS26_M_LDO2TSD_M_SHIFT)
/* Interrupt NOT MASKED */
#define FS26_M_LDO2TSD_M_NOT_MASKED      (0x0001U << FS26_M_LDO2TSD_M_SHIFT)

/* Interrupt MASKED */
#define FS26_M_CORETSD_M_MASKED          (0x0000U << FS26_M_CORETSD_M_SHIFT)
/* Interrupt NOT MASKED */
#define FS26_M_CORETSD_M_NOT_MASKED      (0x0001U << FS26_M_CORETSD_M_SHIFT)

/* Interrupt MASKED */
#define FS26_M_TRK1TSD_M_MASKED          (0x0000U << FS26_M_TRK1TSD_M_SHIFT)
/* Interrupt NOT MASKED */
#define FS26_M_TRK1TSD_M_NOT_MASKED      (0x0001U << FS26_M_TRK1TSD_M_SHIFT)

/* Interrupt MASKED */
#define FS26_M_TRK2TSD_M_MASKED          (0x0000U << FS26_M_TRK2TSD_M_SHIFT)
/* Interrupt NOT MASKED */
#define FS26_M_TRK2TSD_M_NOT_MASKED      (0x0001U << FS26_M_TRK2TSD_M_SHIFT)

/* Interrupt MASKED */
#define FS26_M_VPRETSD_M_MASKED          (0x0000U << FS26_M_VPRETSD_M_SHIFT)
/* Interrupt NOT MASKED */
#define FS26_M_VPRETSD_M_NOT_MASKED      (0x0001U << FS26_M_VPRETSD_M_SHIFT)

/* Interrupt MASKED */
#define FS26_M_IO1TSD_M_MASKED           (0x0000U << FS26_M_IO1TSD_M_SHIFT)
/* Interrupt NOT MASKED */
#define FS26_M_IO1TSD_M_NOT_MASKED       (0x0001U << FS26_M_IO1TSD_M_SHIFT)

/* Interrupt MASKED */
#define FS26_M_TWARN_M_MASKED            (0x0000U << FS26_M_TWARN_M_SHIFT)
/* Interrupt NOT MASKED */
#define FS26_M_TWARN_M_NOT_MASKED        (0x0001U << FS26_M_TWARN_M_SHIFT)

/******************************************************************************/
/* M_REG_FLG - Type: RW                                                       */
/******************************************************************************/
#define FS26_M_REG_FLG_ADDR              0x05U
#define FS26_M_REG_FLG_DEFAULT           0x0000U

/* Interrupt flag when LDO1 Over Current event occurs */
#define FS26_M_LDO1OC_I_MASK             0x0001U
#define FS26_M_LDO1OC_I_SHIFT            0x0000U
/* Interrupt flag when LDO2 Over Current event occurs */
#define FS26_M_LDO2OC_I_MASK             0x0002U
#define FS26_M_LDO2OC_I_SHIFT            0x0001U
/* Interrupt flag when VCORE Over Current event occurs */
#define FS26_M_COREOC_I_MASK             0x0004U
#define FS26_M_COREOC_I_SHIFT            0x0002U
/* Interrupt flag when TRK1 Over Current event occurs */
#define FS26_M_TRK1OC_I_MASK             0x0008U
#define FS26_M_TRK1OC_I_SHIFT            0x0003U
/* Interrupt flag when TRK2 Over Current event occurs */
#define FS26_M_TRK2OC_I_MASK             0x0010U
#define FS26_M_TRK2OC_I_SHIFT            0x0004U
/* Interrupt flag when VPRE Over Current event occurs */
#define FS26_M_VPREOC_I_MASK             0x0020U
#define FS26_M_VPREOC_I_SHIFT            0x0005U
/* Interrupt flag when VBST Over Current event occurs */
#define FS26_M_VBSTOC_I_MASK             0x0040U
#define FS26_M_VBSTOC_I_SHIFT            0x0006U
/* Interrupt flag when VPRE crosses it UVH threshold on the falling edge */
#define FS26_M_VPREUVH_I_MASK            0x0080U
#define FS26_M_VPREUVH_I_SHIFT           0x0007U
/* Interrupt flag when VBST_FB has crossed Over Voltage Threshold */
#define FS26_M_VBSTOV_I_MASK             0x0100U
#define FS26_M_VBSTOV_I_SHIFT            0x0008U

/* No Over current event detected */
#define FS26_M_LDO1OC_I_NO_EVENT         (0x0000U << FS26_M_LDO1OC_I_SHIFT)
/* Over current event occurred */
#define FS26_M_LDO1OC_I_EVENT            (0x0001U << FS26_M_LDO1OC_I_SHIFT)

/* No Over current event detected */
#define FS26_M_LDO2OC_I_NO_EVENT         (0x0000U << FS26_M_LDO2OC_I_SHIFT)
/* Over current event occurred */
#define FS26_M_LDO2OC_I_EVENT            (0x0001U << FS26_M_LDO2OC_I_SHIFT)

/* No Over current event detected */
#define FS26_M_COREOC_I_NO_EVENT         (0x0000U << FS26_M_COREOC_I_SHIFT)
/* Over current event occurred */
#define FS26_M_COREOC_I_EVENT            (0x0001U << FS26_M_COREOC_I_SHIFT)

/* No Over current event detected */
#define FS26_M_TRK1OC_I_NO_EVENT         (0x0000U << FS26_M_TRK1OC_I_SHIFT)
/* Over current event occurred */
#define FS26_M_TRK1OC_I_EVENT            (0x0001U << FS26_M_TRK1OC_I_SHIFT)

/* No Over current event detected */
#define FS26_M_TRK2OC_I_NO_EVENT         (0x0000U << FS26_M_TRK2OC_I_SHIFT)
/* Over current event occurred */
#define FS26_M_TRK2OC_I_EVENT            (0x0001U << FS26_M_TRK2OC_I_SHIFT)

/* No Over current event detected */
#define FS26_M_VPREOC_I_NO_EVENT         (0x0000U << FS26_M_VPREOC_I_SHIFT)
/* Over current event occurred */
#define FS26_M_VPREOC_I_EVENT            (0x0001U << FS26_M_VPREOC_I_SHIFT)

/* No Over current event detected */
#define FS26_M_VBSTOC_I_NO_EVENT         (0x0000U << FS26_M_VBSTOC_I_SHIFT)
/* Over current event occurred */
#define FS26_M_VBSTOC_I_EVENT            (0x0001U << FS26_M_VBSTOC_I_SHIFT)

/* VPRE has not cross VPRE_UVH threshold */
#define FS26_M_VPREUVH_I_NOT_CROSSED     (0x0000U << FS26_M_VPREUVH_I_SHIFT)
/* VPRE crossed VPRE_UVH threshold */
#define FS26_M_VPREUVH_I_CROSSED         (0x0001U << FS26_M_VPREUVH_I_SHIFT)

/* VBST has not cross VBST_OV_TH threshold */
#define FS26_M_VBSTOV_I_NOT_CROSSED      (0x0000U << FS26_M_VBSTOV_I_SHIFT)
/* VBST crossed VBST_OV_TH threshold */
#define FS26_M_VBSTOV_I_CROSSED          (0x0001U << FS26_M_VBSTOV_I_SHIFT)

/******************************************************************************/
/* M_REG_MSK - Type: RW                                                       */
/******************************************************************************/
#define FS26_M_REG_MSK_ADDR              0x06U
#define FS26_M_REG_MSK_DEFAULT           0x0000U

/* Inhibit Interrupt when LDO1 Over Current event occurs */
#define FS26_M_LDO1OC_M_MASK             0x0001U
#define FS26_M_LDO1OC_M_SHIFT            0x0000U
/* Inhibit Interrupt when LDO2 Over Current event occurs */
#define FS26_M_LDO2OC_M_MASK             0x0002U
#define FS26_M_LDO2OC_M_SHIFT            0x0001U
/* Inhibit Interrupt when VCORE Over Current event occurs */
#define FS26_M_COREOC_M_MASK             0x0004U
#define FS26_M_COREOC_M_SHIFT            0x0002U
/* Inhibit Interrupt when TRK1 Over Current event occurs */
#define FS26_M_TRK1OC_M_MASK             0x0008U
#define FS26_M_TRK1OC_M_SHIFT            0x0003U
/* Inhibit Interrupt when TRK2 Over Current event occurs */
#define FS26_M_TRK2OC_M_MASK             0x0010U
#define FS26_M_TRK2OC_M_SHIFT            0x0004U
/* Inhibit Interrupt when VPRE Over Current event occurs */
#define FS26_M_VPREOC_M_MASK             0x0020U
#define FS26_M_VPREOC_M_SHIFT            0x0005U
/* Inhibit Interrupt when VBST Over Current event occurs */
#define FS26_M_VBSTOC_M_MASK             0x0040U
#define FS26_M_VBSTOC_M_SHIFT            0x0006U
/* Inhibit Interrupt when VPRE Under Voltage event occurs */
#define FS26_M_VPREUVH_M_MASK            0x0080U
#define FS26_M_VPREUVH_M_SHIFT           0x0007U
/* Inhibit Interrupt when VBST Over Voltage event occurs */
#define FS26_M_VBSTOV_M_MASK             0x0100U
#define FS26_M_VBSTOV_M_SHIFT            0x0008U

/* Interrupt MASKED */
#define FS26_M_LDO1OC_M_MASKED           (0x0000U << FS26_M_LDO1OC_M_SHIFT)
/* Interrupt NOT MASKED */
#define FS26_M_LDO1OC_M_NOT_MASKED       (0x0001U << FS26_M_LDO1OC_M_SHIFT)

/* Interrupt MASKED */
#define FS26_M_LDO2OC_M_MASKED           (0x0000U << FS26_M_LDO2OC_M_SHIFT)
/* Interrupt NOT MASKED */
#define FS26_M_LDO2OC_M_NOT_MASKED       (0x0001U << FS26_M_LDO2OC_M_SHIFT)

/* Interrupt MASKED */
#define FS26_M_COREOC_M_MASKED           (0x0000U << FS26_M_COREOC_M_SHIFT)
/* Interrupt NOT MASKED */
#define FS26_M_COREOC_M_NOT_MASKED       (0x0001U << FS26_M_COREOC_M_SHIFT)

/* Interrupt MASKED */
#define FS26_M_TRK1OC_M_MASKED           (0x0000U << FS26_M_TRK1OC_M_SHIFT)
/* Interrupt NOT MASKED */
#define FS26_M_TRK1OC_M_NOT_MASKED       (0x0001U << FS26_M_TRK1OC_M_SHIFT)

/* Interrupt MASKED */
#define FS26_M_TRK2OC_M_MASKED           (0x0000U << FS26_M_TRK2OC_M_SHIFT)
/* Interrupt NOT MASKED */
#define FS26_M_TRK2OC_M_NOT_MASKED       (0x0001U << FS26_M_TRK2OC_M_SHIFT)

/* Interrupt MASKED */
#define FS26_M_VPREOC_M_MASKED           (0x0000U << FS26_M_VPREOC_M_SHIFT)
/* Interrupt NOT MASKED */
#define FS26_M_VPREOC_M_NOT_MASKED       (0x0001U << FS26_M_VPREOC_M_SHIFT)

/* Interrupt MASKED */
#define FS26_M_VBSTOC_M_MASKED           (0x0000U << FS26_M_VBSTOC_M_SHIFT)
/* Interrupt NOT MASKED */
#define FS26_M_VBSTOC_M_NOT_MASKED       (0x0001U << FS26_M_VBSTOC_M_SHIFT)

/* Interrupt MASKED */
#define FS26_M_VPREUVH_M_MASKED          (0x0000U << FS26_M_VPREUVH_M_SHIFT)
/* Interrupt NOT MASKED */
#define FS26_M_VPREUVH_M_NOT_MASKED      (0x0001U << FS26_M_VPREUVH_M_SHIFT)

/* Interrupt MASKED */
#define FS26_M_VBSTOV_M_MASKED           (0x0000U << FS26_M_VBSTOV_M_SHIFT)
/* Interrupt NOT MASKED */
#define FS26_M_VBSTOV_M_NOT_MASKED       (0x0001U << FS26_M_VBSTOV_M_SHIFT)

/******************************************************************************/
/* M_VSUP_FLG - Type: RW                                                      */
/******************************************************************************/
#define FS26_M_VSUP_FLG_ADDR             0x07U
#define FS26_M_VSUP_FLG_DEFAULT          0x0000U

/* Interrupt flag when VSUP has crossed its UVH threshold on the falling edge */
#define FS26_M_VSUPUVH_I_MASK            0x0001U
#define FS26_M_VSUPUVH_I_SHIFT           0x0000U
/* Interrupt flag when VSUP has crossed its UV6 threshold on the falling edge */
#define FS26_M_VSUPUV6_I_MASK            0x0002U
#define FS26_M_VSUPUV6_I_SHIFT           0x0001U
/* Interrupt flag when VSUP has crossed its OV threshold on the rising edge */
#define FS26_M_VSUPOV_I_MASK             0x0004U
#define FS26_M_VSUPOV_I_SHIFT            0x0002U
/* Interrupt flag when VBOS has crossed its UVH threshold on the falling edge */
#define FS26_M_VBOSUVH_I_MASK            0x0008U
#define FS26_M_VBOSUVH_I_SHIFT           0x0003U

/* No VSUP UVH event detected */
#define FS26_M_VSUPUVH_I_NO_EVENT        (0x0000U << FS26_M_VSUPUVH_I_SHIFT)
/* VSUP UVH event occurred */
#define FS26_M_VSUPUVH_I_EVENT           (0x0001U << FS26_M_VSUPUVH_I_SHIFT)

/* No VSUP UV6 event detected */
#define FS26_M_VSUPUV6_I_NO_EVENT        (0x0000U << FS26_M_VSUPUV6_I_SHIFT)
/* VSUP UV6 event occurred */
#define FS26_M_VSUPUV6_I_EVENT           (0x0001U << FS26_M_VSUPUV6_I_SHIFT)

/* No VSUP OV event detected */
#define FS26_M_VSUPOV_I_NO_EVENT         (0x0000U << FS26_M_VSUPOV_I_SHIFT)
/* VSUP OV event occurred */
#define FS26_M_VSUPOV_I_EVENT            (0x0001U << FS26_M_VSUPOV_I_SHIFT)

