nxp-appcodehub/dm-power-delivery-frdm-a-s32k344/src/drivers/inc/fs26_map.h
/* No VBOS UVH event detected */
#define FS26_M_VBOSUVH_I_NO_EVENT        (0x0000U << FS26_M_VBOSUVH_I_SHIFT)
/* VBOS UVH event occurred */
#define FS26_M_VBOSUVH_I_EVENT           (0x0001U << FS26_M_VBOSUVH_I_SHIFT)

/******************************************************************************/
/* M_VSUP_MSK - Type: RW                                                      */
/******************************************************************************/
#define FS26_M_VSUP_MSK_ADDR             0x08U
#define FS26_M_VSUP_MSK_DEFAULT          0x0000U

/* Inhibit Interrupt when VSUP UVH event occurs */
#define FS26_M_VSUPUVH_M_MASK            0x0001U
#define FS26_M_VSUPUVH_M_SHIFT           0x0000U
/* Inhibit Interrupt when VSUP UV6 event occurs */
#define FS26_M_VSUPUV6_M_MASK            0x0002U
#define FS26_M_VSUPUV6_M_SHIFT           0x0001U
/* Inhibit Interrupt when VSUP Over Voltage event occurs */
#define FS26_M_VSUPOV_M_MASK             0x0004U
#define FS26_M_VSUPOV_M_SHIFT            0x0002U
/* Inhibit Interrupt when VBOS UVH event occurs */
#define FS26_M_VBOSUVH_M_MASK            0x0008U
#define FS26_M_VBOSUVH_M_SHIFT           0x0003U

/* Interrupt MASKED */
#define FS26_M_VSUPUVH_M_MASKED          (0x0000U << FS26_M_VSUPUVH_M_SHIFT)
/* Interrupt NOT MASKED */
#define FS26_M_VSUPUVH_M_NOT_MASKED      (0x0001U << FS26_M_VSUPUVH_M_SHIFT)

/* Interrupt MASKED */
#define FS26_M_VSUPUV6_M_MASKED          (0x0000U << FS26_M_VSUPUV6_M_SHIFT)
/* Interrupt NOT MASKED */
#define FS26_M_VSUPUV6_M_NOT_MASKED      (0x0001U << FS26_M_VSUPUV6_M_SHIFT)

/* Interrupt MASKED */
#define FS26_M_VSUPOV_M_MASKED           (0x0000U << FS26_M_VSUPOV_M_SHIFT)
/* Interrupt NOT MASKED */
#define FS26_M_VSUPOV_M_NOT_MASKED       (0x0001U << FS26_M_VSUPOV_M_SHIFT)

/* Interrupt MASKED */
#define FS26_M_VBOSUVH_M_MASKED          (0x0000U << FS26_M_VBOSUVH_M_SHIFT)
/* Interrupt NOT MASKED */
#define FS26_M_VBOSUVH_M_NOT_MASKED      (0x0001U << FS26_M_VBOSUVH_M_SHIFT)

/******************************************************************************/
/* M_WIO_FLG - Type: RW                                                       */
/******************************************************************************/
#define FS26_M_WIO_FLG_ADDR              0x09U
#define FS26_M_WIO_FLG_DEFAULT           0x0000U

/* WAKE1 event Flag */
#define FS26_M_WK1_I_MASK                0x0001U
#define FS26_M_WK1_I_SHIFT               0x0000U
/* WAKE2 event Flag */
#define FS26_M_WK2_I_MASK                0x0002U
#define FS26_M_WK2_I_SHIFT               0x0001U
/* GPIO1 event Flag */
#define FS26_M_IO1_I_MASK                0x0004U
#define FS26_M_IO1_I_SHIFT               0x0002U
/* GPIO2 event Flag */
#define FS26_M_IO2_I_MASK                0x0008U
#define FS26_M_IO2_I_SHIFT               0x0003U
/* LDT event Flag */
#define FS26_M_LDT_I_MASK                0x0010U
#define FS26_M_LDT_I_SHIFT               0x0004U
/* Wake-up Event Source */
#define FS26_M_WUEVENT_MASK              0x0F00U
#define FS26_M_WUEVENT_SHIFT             0x0008U
/* Clear Wake up Flags */
#define FS26_M_WU_CLR_MASK               0x8000U
#define FS26_M_WU_CLR_SHIFT              0x000FU

/* No event on WAKE1 */
#define FS26_M_WK1_I_NO_EVENT            (0x0000U << FS26_M_WK1_I_SHIFT)
/* Event on WAKE1 has occurred */
#define FS26_M_WK1_I_EVENT               (0x0001U << FS26_M_WK1_I_SHIFT)

/* No event on WAKE2 */
#define FS26_M_WK2_I_NO_EVENT            (0x0000U << FS26_M_WK2_I_SHIFT)
/* Event on WAKE2 has occurred */
#define FS26_M_WK2_I_EVENT               (0x0001U << FS26_M_WK2_I_SHIFT)

/* No event on GPIO1 */
#define FS26_M_IO1_I_NO_EVENT            (0x0000U << FS26_M_IO1_I_SHIFT)
/* Event on GPIO1 has occurred */
#define FS26_M_IO1_I_EVENT               (0x0001U << FS26_M_IO1_I_SHIFT)

/* No event on GPIO2 */
#define FS26_M_IO2_I_NO_EVENT            (0x0000U << FS26_M_IO2_I_SHIFT)
/* Event on GPIO2 has occurred */
#define FS26_M_IO2_I_EVENT               (0x0001U << FS26_M_IO2_I_SHIFT)

/* No event on LDT */
#define FS26_M_LDT_I_NO_EVENT            (0x0000U << FS26_M_LDT_I_SHIFT)
/* LDT Expire Event has occurred */
#define FS26_M_LDT_I_EVENT               (0x0001U << FS26_M_LDT_I_SHIFT)

/* No Wake up detected */
#define FS26_M_WUEVENT_NO_WAKE           (0x0000U << FS26_M_WUEVENT_SHIFT)
/* WAKE1 */
#define FS26_M_WUEVENT_WAKE1             (0x0001U << FS26_M_WUEVENT_SHIFT)
/* WAKE2 */
#define FS26_M_WUEVENT_WAKE2             (0x0002U << FS26_M_WUEVENT_SHIFT)
/* GPIO1 */
#define FS26_M_WUEVENT_GPIO1             (0x0003U << FS26_M_WUEVENT_SHIFT)
/* GPIO2 */
#define FS26_M_WUEVENT_GPIO2             (0x0004U << FS26_M_WUEVENT_SHIFT)
/* LDT expired */
#define FS26_M_WUEVENT_LDT_EXP           (0x0005U << FS26_M_WUEVENT_SHIFT)
/* SPI activity */
#define FS26_M_WUEVENT_SPI_ACTIVE        (0x0006U << FS26_M_WUEVENT_SHIFT)
/* Reserved */
#define FS26_M_WUEVENT_RES_7             (0x0007U << FS26_M_WUEVENT_SHIFT)
/* DFS Recovery */
#define FS26_M_WUEVENT_DFS_REC           (0x0008U << FS26_M_WUEVENT_SHIFT)
/* Reserved */
#define FS26_M_WUEVENT_RES_9             (0x0009U << FS26_M_WUEVENT_SHIFT)
/* Reserved */
#define FS26_M_WUEVENT_RES_10            (0x000AU << FS26_M_WUEVENT_SHIFT)
/* Reserved */
#define FS26_M_WUEVENT_RES_11            (0x000BU << FS26_M_WUEVENT_SHIFT)
/* Reserved */
#define FS26_M_WUEVENT_RES_12            (0x000CU << FS26_M_WUEVENT_SHIFT)
/* Reserved */
#define FS26_M_WUEVENT_RES_13            (0x000DU << FS26_M_WUEVENT_SHIFT)
/* Reserved */
#define FS26_M_WUEVENT_RES_14            (0x000EU << FS26_M_WUEVENT_SHIFT)
/* BATTERY fail */
#define FS26_M_WUEVENT_BATT_FAIL         (0x000FU << FS26_M_WUEVENT_SHIFT)

/* Do nothing */
#define FS26_M_WU_CLR_NOTHING            (0x0000U << FS26_M_WU_CLR_SHIFT)
/* Clear all Wakeup Flags */
#define FS26_M_WU_CLR_CLEAR_ALL          (0x0001U << FS26_M_WU_CLR_SHIFT)

/******************************************************************************/
/* M_WIO_MSK - Type: RW                                                       */
/******************************************************************************/
#define FS26_M_WIO_MSK_ADDR              0x0AU
#define FS26_M_WIO_MSK_DEFAULT           0x0000U

