nxp-appcodehub/dm-power-delivery-frdm-a-s32k344/src/drivers/inc/fs26_map.h
/* Inhibit interrupt when WAKE1 event occurs */
#define FS26_M_WK1_M_MASK                0x0001U
#define FS26_M_WK1_M_SHIFT               0x0000U
/* Inhibit Interrupt when WAKE2 event occurs */
#define FS26_M_WK2_M_MASK                0x0002U
#define FS26_M_WK2_M_SHIFT               0x0001U
/* Inhibit Interrupt when GPIO1 event occurs */
#define FS26_M_IO1_M_MASK                0x0004U
#define FS26_M_IO1_M_SHIFT               0x0002U
/* Inhibit Interrupt when GPIO2 event occurs */
#define FS26_M_IO2_M_MASK                0x0008U
#define FS26_M_IO2_M_SHIFT               0x0003U
/* Inhibit Interrupt if LDT event occurs */
#define FS26_M_LDT_M_MASK                0x0010U
#define FS26_M_LDT_M_SHIFT               0x0004U

/* Interrupt NOT MASKED */
#define FS26_M_WK1_M_NOT_MASKED          (0x0000U << FS26_M_WK1_M_SHIFT)
/* Interrupt MASKED */
#define FS26_M_WK1_M_MASKED              (0x0001U << FS26_M_WK1_M_SHIFT)

/* Interrupt NOT MASKED */
#define FS26_M_WK2_M_NOT_MASKED          (0x0000U << FS26_M_WK2_M_SHIFT)
/* Interrupt MASKED */
#define FS26_M_WK2_M_MASKED              (0x0001U << FS26_M_WK2_M_SHIFT)

/* Interrupt NOT MASKED */
#define FS26_M_IO1_M_NOT_MASKED          (0x0000U << FS26_M_IO1_M_SHIFT)
/* Interrupt MASKED */
#define FS26_M_IO1_M_MASKED              (0x0001U << FS26_M_IO1_M_SHIFT)

/* Interrupt NOT MASKED */
#define FS26_M_IO2_M_NOT_MASKED          (0x0000U << FS26_M_IO2_M_SHIFT)
/* Interrupt MASKED */
#define FS26_M_IO2_M_MASKED              (0x0001U << FS26_M_IO2_M_SHIFT)

/* Interrupt NOT MASKED */
#define FS26_M_LDT_M_NOT_MASKED          (0x0000U << FS26_M_LDT_M_SHIFT)
/* Interrupt MASKED */
#define FS26_M_LDT_M_MASKED              (0x0001U << FS26_M_LDT_M_SHIFT)

/******************************************************************************/
/* M_COM_FLG - Type: RW                                                       */
/******************************************************************************/
#define FS26_M_COM_FLG_ADDR              0x0BU
#define FS26_M_COM_FLG_DEFAULT           0x0000U

/* Interrupt flag when the MCU writes to an invalid register in the Main domain */
#define FS26_M_MSPI_REQ_I_MASK           0x0001U
#define FS26_M_MSPI_REQ_I_SHIFT          0x0000U
/* Interrupt flag when the Main SPI clock provides wrong number of clock pulses */
#define FS26_M_MSPI_CLK_I_MASK           0x0002U
#define FS26_M_MSPI_CLK_I_SHIFT          0x0001U
/* Interrupt flag when the Main SPI CRC calculation is incorrect */
#define FS26_M_MSPI_CRC_I_MASK           0x0004U
#define FS26_M_MSPI_CRC_I_SHIFT          0x0002U

/* Interrupt detected */
#define FS26_M_MSPI_REQ_I_DETECTED       (0x0000U << FS26_M_MSPI_REQ_I_SHIFT)
/* Interrupt not detected */
#define FS26_M_MSPI_REQ_I_NOT_DETECTED   (0x0001U << FS26_M_MSPI_REQ_I_SHIFT)

/* Interrupt detected */
#define FS26_M_MSPI_CLK_I_DETECTED       (0x0000U << FS26_M_MSPI_CLK_I_SHIFT)
/* Interrupt not detected */
#define FS26_M_MSPI_CLK_I_NOT_DETECTED   (0x0001U << FS26_M_MSPI_CLK_I_SHIFT)

/* Interrupt detected */
#define FS26_M_MSPI_CRC_I_DETECTED       (0x0000U << FS26_M_MSPI_CRC_I_SHIFT)
/* Interrupt not detected */
#define FS26_M_MSPI_CRC_I_NOT_DETECTED   (0x0001U << FS26_M_MSPI_CRC_I_SHIFT)

/******************************************************************************/
/* M_COM_MSK - Type: RW                                                       */
/******************************************************************************/
#define FS26_M_COM_MSK_ADDR              0x0CU
#define FS26_M_COM_MSK_DEFAULT           0x0000U

/* Inhibit Interrupt when the MCU writes to invalid register */
#define FS26_M_MSPI_REQ_M_MASK           0x0001U
#define FS26_M_MSPI_REQ_M_SHIFT          0x0000U
/* Inhibit Interrupt when the SPI clock provides wrong number of clock pulses */
#define FS26_M_MSPI_CLK_M_MASK           0x0002U
#define FS26_M_MSPI_CLK_M_SHIFT          0x0001U
/* Inhibit Interrupt when the Main calculation is incorrect */
#define FS26_M_MSPI_CRC_M_MASK           0x0004U
#define FS26_M_MSPI_CRC_M_SHIFT          0x0002U

/* Interrupt NOT MASKED */
#define FS26_M_MSPI_REQ_M_NOT_MASKED     (0x0000U << FS26_M_MSPI_REQ_M_SHIFT)
/* Interrupt MASKED */
#define FS26_M_MSPI_REQ_M_MASKED         (0x0001U << FS26_M_MSPI_REQ_M_SHIFT)

/* Interrupt NOT MASKED */
#define FS26_M_MSPI_CLK_M_NOT_MASKED     (0x0000U << FS26_M_MSPI_CLK_M_SHIFT)
/* Interrupt MASKED */
#define FS26_M_MSPI_CLK_M_MASKED         (0x0001U << FS26_M_MSPI_CLK_M_SHIFT)

/* Interrupt NOT MASKED */
#define FS26_M_MSPI_CRC_M_NOT_MASKED     (0x0000U << FS26_M_MSPI_CRC_M_SHIFT)
/* Interrupt MASKED */
#define FS26_M_MSPI_CRC_M_MASKED         (0x0001U << FS26_M_MSPI_CRC_M_SHIFT)

/******************************************************************************/
/* M_SYS_CFG - Type: RW                                                       */
/******************************************************************************/
#define FS26_M_SYS_CFG_ADDR              0x0DU
#define FS26_M_SYS_CFG_DEFAULT           0x0000U

/* Frequency Spread Spectrum enable */
#define FS26_M_FSS_EN_MASK               0x0001U
#define FS26_M_FSS_EN_SHIFT              0x0000U
/* Frequency modulation during FSS Operation */
#define FS26_M_FSS_FMOD_MASK             0x0004U
#define FS26_M_FSS_FMOD_SHIFT            0x0002U
/* INTB Test pulse width */
#define FS26_M_INT_PWIDTH_MASK           0x0008U
#define FS26_M_INT_PWIDTH_SHIFT          0x0003U
/* Manual Test of INTB pin */
#define FS26_M_INTB_TEST_MASK            0x0010U
#define FS26_M_INTB_TEST_SHIFT           0x0004U
/* Clear Retry Counter */
#define FS26_M_RETRY_CLR_MASK            0x0080U
#define FS26_M_RETRY_CLR_SHIFT           0x0007U
/* Retry counter time (ms) */
#define FS26_M_RETRY_CNT_MASK            0xFF00U
#define FS26_M_RETRY_CNT_SHIFT           0x0008U

/* FSS is Disabled */
#define FS26_M_FSS_EN_DISABLED           (0x0000U << FS26_M_FSS_EN_SHIFT)
/* FSS is Enabled */
#define FS26_M_FSS_EN_ENABLED            (0x0001U << FS26_M_FSS_EN_SHIFT)

/* High Frequency Oscillator divided by 896 */
#define FS26_M_FSS_FMOD_DIV_896          (0x0000U << FS26_M_FSS_FMOD_SHIFT)
/* High Frequency Oscillator divided by 224 */
#define FS26_M_FSS_FMOD_DIV_224          (0x0001U << FS26_M_FSS_FMOD_SHIFT)

/* 25us */
#define FS26_M_INT_PWIDTH_25US           (0x0000U << FS26_M_INT_PWIDTH_SHIFT)
/* 100us */
#define FS26_M_INT_PWIDTH_100US          (0x0001U << FS26_M_INT_PWIDTH_SHIFT)

