nxp-appcodehub/dm-power-delivery-frdm-a-s32k344/src/drivers/inc/fs26_map.h
/* No effect */
#define FS26_M_INTB_TEST_NO_EFFECT       (0x0000U << FS26_M_INTB_TEST_SHIFT)
/* Enable manual test */
#define FS26_M_INTB_TEST_MANUAL          (0x0001U << FS26_M_INTB_TEST_SHIFT)

/* No effect */
#define FS26_M_RETRY_CLR_NO_EFFECT       (0x0000U << FS26_M_RETRY_CLR_SHIFT)
/* Clear Retry Counter */
#define FS26_M_RETRY_CLR_CLEAR           (0x0001U << FS26_M_RETRY_CLR_SHIFT)

/* 100 */
#define FS26_M_RETRY_CNT_100             (0x0000U << FS26_M_RETRY_CNT_SHIFT)
/* 200 */
#define FS26_M_RETRY_CNT_200             (0x0001U << FS26_M_RETRY_CNT_SHIFT)
/* 400 */
#define FS26_M_RETRY_CNT_400             (0x0002U << FS26_M_RETRY_CNT_SHIFT)
/* 800 */
#define FS26_M_RETRY_CNT_800             (0x0003U << FS26_M_RETRY_CNT_SHIFT)
/* 1600 */
#define FS26_M_RETRY_CNT_1600            (0x0004U << FS26_M_RETRY_CNT_SHIFT)
/* 3200 */
#define FS26_M_RETRY_CNT_3200            (0x0005U << FS26_M_RETRY_CNT_SHIFT)
/* 6400 */
#define FS26_M_RETRY_CNT_6400            (0x0006U << FS26_M_RETRY_CNT_SHIFT)
/* 12800 */
#define FS26_M_RETRY_CNT_12800           (0x0007U << FS26_M_RETRY_CNT_SHIFT)
/* 25600 */
#define FS26_M_RETRY_CNT_25600           (0x0008U << FS26_M_RETRY_CNT_SHIFT)
/* 51200 */
#define FS26_M_RETRY_CNT_51200           (0x0009U << FS26_M_RETRY_CNT_SHIFT)
/* 102400 */
#define FS26_M_RETRY_CNT_102400          (0x000AU << FS26_M_RETRY_CNT_SHIFT)
/* 204800 */
#define FS26_M_RETRY_CNT_204800          (0x000BU << FS26_M_RETRY_CNT_SHIFT)
/* 409600 */
#define FS26_M_RETRY_CNT_409600          (0x000CU << FS26_M_RETRY_CNT_SHIFT)
/* 819200 */
#define FS26_M_RETRY_CNT_819200          (0x000DU << FS26_M_RETRY_CNT_SHIFT)
/* 1638400 */
#define FS26_M_RETRY_CNT_1638400         (0x000EU << FS26_M_RETRY_CNT_SHIFT)

/******************************************************************************/
/* M_TSD_CFG - Type: RW                                                       */
/******************************************************************************/
#define FS26_M_TSD_CFG_ADDR              0x0EU
#define FS26_M_TSD_CFG_DEFAULT           0x0000U

/* Deep Fail-Safe request in case of LDO1 Thermal Shutdown */
#define FS26_M_LDO1TDFS_MASK             0x0001U
#define FS26_M_LDO1TDFS_SHIFT            0x0000U
/* Deep Fail-Safe request in case of LDO2 Thermal Shutdown */
#define FS26_M_LDO2TDFS_MASK             0x0002U
#define FS26_M_LDO2TDFS_SHIFT            0x0001U
/* Deep Fail-Safe request in case of VCORE Thermal Shutdown */
#define FS26_M_CORETDFS_MASK             0x0004U
#define FS26_M_CORETDFS_SHIFT            0x0002U
/* Deep Fail-Safe request in case of TRK1 Thermal Shutdown */
#define FS26_M_TRK1TDFS_MASK             0x0008U
#define FS26_M_TRK1TDFS_SHIFT            0x0003U
/* Deep Fail-Safe request in case of TRK2 Thermal Shutdown */
#define FS26_M_TRK2TDFS_MASK             0x0010U
#define FS26_M_TRK2TDFS_SHIFT            0x0004U
/* Deep Fail-Safe request in case of VPRE Thermal Shutdown */
#define FS26_M_VPRETDFS_MASK             0x0020U
#define FS26_M_VPRETDFS_SHIFT            0x0005U

/* No effect */
#define FS26_M_LDO1TDFS_NO_EFFECT        (0x0000U << FS26_M_LDO1TDFS_SHIFT)
/* Request Transition */
#define FS26_M_LDO1TDFS_REQ_TRANSITION   (0x0001U << FS26_M_LDO1TDFS_SHIFT)

/* No effect */
#define FS26_M_LDO2TDFS_NO_EFFECT        (0x0000U << FS26_M_LDO2TDFS_SHIFT)
/* Request Transition */
#define FS26_M_LDO2TDFS_REQ_TRANSITION   (0x0001U << FS26_M_LDO2TDFS_SHIFT)

/* No effect */
#define FS26_M_CORETDFS_NO_EFFECT        (0x0000U << FS26_M_CORETDFS_SHIFT)
/* Request Transition */
#define FS26_M_CORETDFS_REQ_TRANSITION   (0x0001U << FS26_M_CORETDFS_SHIFT)

/* No effect */
#define FS26_M_TRK1TDFS_NO_EFFECT        (0x0000U << FS26_M_TRK1TDFS_SHIFT)
/* Request Transition */
#define FS26_M_TRK1TDFS_REQ_TRANSITION   (0x0001U << FS26_M_TRK1TDFS_SHIFT)

/* No effect */
#define FS26_M_TRK2TDFS_NO_EFFECT        (0x0000U << FS26_M_TRK2TDFS_SHIFT)
/* Request Transition */
#define FS26_M_TRK2TDFS_REQ_TRANSITION   (0x0001U << FS26_M_TRK2TDFS_SHIFT)

/* No effect */
#define FS26_M_VPRETDFS_NO_EFFECT        (0x0000U << FS26_M_VPRETDFS_SHIFT)
/* Request Transition */
#define FS26_M_VPRETDFS_REQ_TRANSITION   (0x0001U << FS26_M_VPRETDFS_SHIFT)

/******************************************************************************/
/* M_REG_CFG - Type: RW                                                       */
/******************************************************************************/
#define FS26_M_REG_CFG_ADDR              0x0FU
#define FS26_M_REG_CFG_DEFAULT           0x0000U

/* VBST output verification mode */
#define FS26_M_VBST_TMD_MASK             0x0001U
#define FS26_M_VBST_TMD_SHIFT            0x0000U
/* VREF Internal pulldown configuration */
#define FS26_M_VREF_PD_MASK              0x0002U
#define FS26_M_VREF_PD_SHIFT             0x0001U

/* VBST output is regulated to the configured voltage set by OTP */
#define FS26_M_VBST_TMD_OTP              (0x0000U << FS26_M_VBST_TMD_SHIFT)
/* VBST regulate to 17V to verify availability */
#define FS26_M_VBST_TMD_17V              (0x0001U << FS26_M_VBST_TMD_SHIFT)

/* Disable internal pulldown when VREF output is disabled */
#define FS26_M_VREF_PD_DISABLED          (0x0000U << FS26_M_VREF_PD_SHIFT)
/* Enable internal pulldown when VREF output is disabled */
#define FS26_M_VREF_PD_ENABLED           (0x0001U << FS26_M_VREF_PD_SHIFT)

/******************************************************************************/
/* M_WIO_CFG - Type: RW                                                       */
/******************************************************************************/
#define FS26_M_WIO_CFG_ADDR              0x10U
#define FS26_M_WIO_CFG_DEFAULT           0x0000U

/* WAKE1 wake-up enabled */
#define FS26_M_WK1WUEN_MASK              0x0001U
#define FS26_M_WK1WUEN_SHIFT             0x0000U
/* WAKE2 wake-up enabled */
#define FS26_M_WK2WUEN_MASK              0x0002U
#define FS26_M_WK2WUEN_SHIFT             0x0001U
/* GPIO1 wake-up enabled */
#define FS26_M_IO1WUEN_MASK              0x0004U
#define FS26_M_IO1WUEN_SHIFT             0x0002U
/* GPIO2 wake-up enabled */
#define FS26_M_IO2WUEN_MASK              0x0008U
#define FS26_M_IO2WUEN_SHIFT             0x0003U
/* Long Duration Timer wake-up enabled */
#define FS26_M_LDTWUEN_MASK              0x0010U
#define FS26_M_LDTWUEN_SHIFT             0x0004U
/* CSB Transition wake-up enabled */
#define FS26_M_CSBWUEN_MASK              0x0020U
#define FS26_M_CSBWUEN_SHIFT             0x0005U
/* WAKE1 event detection polarity */
#define FS26_M_WAKE1POL_MASK             0x0100U
#define FS26_M_WAKE1POL_SHIFT            0x0008U
/* WAKE2 event detection polarity */
#define FS26_M_WAKE2POL_MASK             0x0200U
#define FS26_M_WAKE2POL_SHIFT            0x0009U
/* GPIO1 event detection polarity */
#define FS26_M_IO1WUPOL_MASK             0x0400U
#define FS26_M_IO1WUPOL_SHIFT            0x000AU
/* GPIO2 event detection polarity */
#define FS26_M_IO2WUPOL_MASK             0x0800U
#define FS26_M_IO2WUPOL_SHIFT            0x000BU

/* Enabled */
#define FS26_M_WK1WUEN_ENABLED           (0x0000U << FS26_M_WK1WUEN_SHIFT)
/* Disabled */
#define FS26_M_WK1WUEN_DISABLED          (0x0001U << FS26_M_WK1WUEN_SHIFT)

/* Enabled */
#define FS26_M_WK2WUEN_ENABLED           (0x0000U << FS26_M_WK2WUEN_SHIFT)
/* Disabled */
#define FS26_M_WK2WUEN_DISABLED          (0x0001U << FS26_M_WK2WUEN_SHIFT)

/* Enabled */
#define FS26_M_IO1WUEN_ENABLED           (0x0000U << FS26_M_IO1WUEN_SHIFT)
/* Disabled */
#define FS26_M_IO1WUEN_DISABLED          (0x0001U << FS26_M_IO1WUEN_SHIFT)

/* Enabled */
#define FS26_M_IO2WUEN_ENABLED           (0x0000U << FS26_M_IO2WUEN_SHIFT)
/* Disabled */
#define FS26_M_IO2WUEN_DISABLED          (0x0001U << FS26_M_IO2WUEN_SHIFT)

/* Enabled */
#define FS26_M_LDTWUEN_ENABLED           (0x0000U << FS26_M_LDTWUEN_SHIFT)
/* Disabled */
#define FS26_M_LDTWUEN_DISABLED          (0x0001U << FS26_M_LDTWUEN_SHIFT)

/* Enabled */
#define FS26_M_CSBWUEN_ENABLED           (0x0000U << FS26_M_CSBWUEN_SHIFT)
/* Disabled */
#define FS26_M_CSBWUEN_DISABLED          (0x0001U << FS26_M_CSBWUEN_SHIFT)

