nxp-appcodehub/dm-power-delivery-frdm-a-s32k344/src/drivers/inc/fs26_map.h
/* High */
#define FS26_M_WAKE1POL_HIGH             (0x0000U << FS26_M_WAKE1POL_SHIFT)
/* Low */
#define FS26_M_WAKE1POL_LOW              (0x0001U << FS26_M_WAKE1POL_SHIFT)

/* High */
#define FS26_M_WAKE2POL_HIGH             (0x0000U << FS26_M_WAKE2POL_SHIFT)
/* Low */
#define FS26_M_WAKE2POL_LOW              (0x0001U << FS26_M_WAKE2POL_SHIFT)

/* High */
#define FS26_M_IO1WUPOL_HIGH             (0x0000U << FS26_M_IO1WUPOL_SHIFT)
/* Low */
#define FS26_M_IO1WUPOL_LOW              (0x0001U << FS26_M_IO1WUPOL_SHIFT)

/* High */
#define FS26_M_IO2WUPOL_HIGH             (0x0000U << FS26_M_IO2WUPOL_SHIFT)
/* Low */
#define FS26_M_IO2WUPOL_LOW              (0x0001U << FS26_M_IO2WUPOL_SHIFT)

/******************************************************************************/
/* M_REG_CTRL1 - Type: RW                                                     */
/******************************************************************************/
#define FS26_M_REG_CTRL1_ADDR            0x11U
#define FS26_M_REG_CTRL1_DEFAULT         0x0000U

/* LDO1 Enable request */
#define FS26_M_LDO1EN_MASK               0x0001U
#define FS26_M_LDO1EN_SHIFT              0x0000U
/* LDO2 Enable request */
#define FS26_M_LDO2EN_MASK               0x0002U
#define FS26_M_LDO2EN_SHIFT              0x0001U
/* VCORE Enable request */
#define FS26_M_COREEN_MASK               0x0004U
#define FS26_M_COREEN_SHIFT              0x0002U
/* TRK1 Enable request */
#define FS26_M_TRK1EN_MASK               0x0008U
#define FS26_M_TRK1EN_SHIFT              0x0003U
/* TRK2 Enable request */
#define FS26_M_TRK2EN_MASK               0x0010U
#define FS26_M_TRK2EN_SHIFT              0x0004U
/* VBST Enable request */
#define FS26_M_VBSTEN_MASK               0x0040U
#define FS26_M_VBSTEN_SHIFT              0x0006U
/* VREF Enable request */
#define FS26_M_VREFEN_MASK               0x0080U
#define FS26_M_VREFEN_SHIFT              0x0007U
/* Request GPIO1 pin High */
#define FS26_M_IO1HI_MASK                0x0100U
#define FS26_M_IO1HI_SHIFT               0x0008U
/* Request GPIO2 pin High */
#define FS26_M_IO2HI_MASK                0x0200U
#define FS26_M_IO2HI_SHIFT               0x0009U
/* Request GPIO2 keep on */
#define FS26_M_IO2ON_MASK                0x2000U
#define FS26_M_IO2ON_SHIFT               0x0012U

/* No effect (Regulator remain in its current state) */
#define FS26_M_LDO1EN_NO_EFFECT          (0x0000U << FS26_M_LDO1EN_SHIFT)
/* LDO1 Enable request */
#define FS26_M_LDO1EN_REQ                (0x0001U << FS26_M_LDO1EN_SHIFT)

/* No effect (Regulator remain in its current state) */
#define FS26_M_LDO2EN_NO_EFFECT          (0x0000U << FS26_M_LDO2EN_SHIFT)
/* LDO2 Enable request */
#define FS26_M_LDO2EN_REQ                (0x0001U << FS26_M_LDO2EN_SHIFT)

/* No effect (Regulator remain in its current state) */
#define FS26_M_COREEN_NO_EFFECT          (0x0000U << FS26_M_COREEN_SHIFT)
/* VCORE Enable request */
#define FS26_M_COREEN_REQ                (0x0001U << FS26_M_COREEN_SHIFT)

/* No effect (Regulator remain in its current state) */
#define FS26_M_TRK1EN_NO_EFFECT          (0x0000U << FS26_M_TRK1EN_SHIFT)
/* TRK1 Enable request */
#define FS26_M_TRK1EN_REQ                (0x0001U << FS26_M_TRK1EN_SHIFT)

/* No effect (Regulator remain in its current state) */
#define FS26_M_TRK2EN_NO_EFFECT          (0x0000U << FS26_M_TRK2EN_SHIFT)
/* TRK2 Enable request */
#define FS26_M_TRK2EN_REQ                (0x0001U << FS26_M_TRK2EN_SHIFT)

/* No effect (Regulator remain in its current state) */
#define FS26_M_VBSTEN_NO_EFFECT          (0x0000U << FS26_M_VBSTEN_SHIFT)
/* VBST Enable request */
#define FS26_M_VBSTEN_REQ                (0x0001U << FS26_M_VBSTEN_SHIFT)

/* No effect (Regulator remain in its current state) */
#define FS26_M_VREFEN_NO_EFFECT          (0x0000U << FS26_M_VREFEN_SHIFT)
/* VREF Enable request */
#define FS26_M_VREFEN_REQ                (0x0001U << FS26_M_VREFEN_SHIFT)

/* No effect (GPIO1 remains in current state) */
#define FS26_M_IO1HI_NO_EFFECT           (0x0000U << FS26_M_IO1HI_SHIFT)
/* GPIO1 set high */
#define FS26_M_IO1HI_REQ                 (0x0001U << FS26_M_IO1HI_SHIFT)

/* No effect (GPIO2 remains in current state) */
#define FS26_M_IO2HI_NO_EFFECT           (0x0000U << FS26_M_IO2HI_SHIFT)
/* GPIO2 set high */
#define FS26_M_IO2HI_REQ                 (0x0001U << FS26_M_IO2HI_SHIFT)

/******************************************************************************/
/* M_REG_CTRL2 - Type: RW                                                     */
/******************************************************************************/
#define FS26_M_REG_CTRL2_ADDR            0x12U
#define FS26_M_REG_CTRL2_DEFAULT         0x0000U

/* LDO1 Disable request */
#define FS26_M_LDO1DIS_MASK              0x0001U
#define FS26_M_LDO1DIS_SHIFT             0x0000U
/* LDO2 Disable request */
#define FS26_M_LDO2DIS_MASK              0x0002U
#define FS26_M_LDO2DIS_SHIFT             0x0001U
/* VCORE Disable request */
#define FS26_M_COREDIS_MASK              0x0004U
#define FS26_M_COREDIS_SHIFT             0x0002U
/* TRK1 Disable request */
#define FS26_M_TRK1DIS_MASK              0x0008U
#define FS26_M_TRK1DIS_SHIFT             0x0003U
/* TRK2 Disable request */
#define FS26_M_TRK2DIS_MASK              0x0010U
#define FS26_M_TRK2DIS_SHIFT             0x0004U
/* VBST Disable request */
#define FS26_M_VBSTDIS_MASK              0x0040U
#define FS26_M_VBSTDIS_SHIFT             0x0006U
/* VREF Disable request */
#define FS26_M_VREFDIS_MASK              0x0080U
#define FS26_M_VREFDIS_SHIFT             0x0007U
/* Request GPIO1 pin Low */
#define FS26_M_IO1LO_MASK                0x0100U
#define FS26_M_IO1LO_SHIFT               0x0008U
/* Request GPIO2 pin Low */
#define FS26_M_IO2LO_MASK                0x0200U
#define FS26_M_IO2LO_SHIFT               0x0009U

/* No effect (Regulator remain in its current state) */
#define FS26_M_LDO1DIS_NO_EFFECT         (0x0000U << FS26_M_LDO1DIS_SHIFT)
/* LDO1 Disable request */
#define FS26_M_LDO1DIS_REQ               (0x0001U << FS26_M_LDO1DIS_SHIFT)

