nxp-appcodehub/dm-power-delivery-frdm-a-s32k344/src/drivers/inc/fs26_map.h
/* No effect (Regulator remain in its current state) */
#define FS26_M_LDO2DIS_NO_EFFECT         (0x0000U << FS26_M_LDO2DIS_SHIFT)
/* LDO2 Disable request */
#define FS26_M_LDO2DIS_REQ               (0x0001U << FS26_M_LDO2DIS_SHIFT)

/* No effect (Regulator remain in its current state) */
#define FS26_M_COREDIS_NO_EFFECT         (0x0000U << FS26_M_COREDIS_SHIFT)
/* VCORE Disable request */
#define FS26_M_COREDIS_REQ               (0x0001U << FS26_M_COREDIS_SHIFT)

/* No effect (Regulator remain in its current state) */
#define FS26_M_TRK1DIS_NO_EFFECT         (0x0000U << FS26_M_TRK1DIS_SHIFT)
/* TRK1 Disable request */
#define FS26_M_TRK1DIS_REQ               (0x0001U << FS26_M_TRK1DIS_SHIFT)

/* No effect (Regulator remain in its current state) */
#define FS26_M_TRK2DIS_NO_EFFECT         (0x0000U << FS26_M_TRK2DIS_SHIFT)
/* TRK2 Disable request */
#define FS26_M_TRK2DIS_REQ               (0x0001U << FS26_M_TRK2DIS_SHIFT)

/* No effect (Regulator remain in its current state) */
#define FS26_M_VBSTDIS_NO_EFFECT         (0x0000U << FS26_M_VBSTDIS_SHIFT)
/* VBST Disable request */
#define FS26_M_VBSTDIS_REQ               (0x0001U << FS26_M_VBSTDIS_SHIFT)

/* No effect (Regulator remain in its current state) */
#define FS26_M_VREFDIS_NO_EFFECT         (0x0000U << FS26_M_VREFDIS_SHIFT)
/* VREF Disable request */
#define FS26_M_VREFDIS_REQ               (0x0001U << FS26_M_VREFDIS_SHIFT)

/* No effect (GPIO1 remains in current state) */
#define FS26_M_IO1LO_NO_EFFECT           (0x0000U << FS26_M_IO1LO_SHIFT)
/* GPIO1 set low */
#define FS26_M_IO1LO_REQ                 (0x0001U << FS26_M_IO1LO_SHIFT)

/* No effect (GPIO2 remains in current state) */
#define FS26_M_IO2LO_NO_EFFECT           (0x0000U << FS26_M_IO2LO_SHIFT)
/* GPIO2 set low */
#define FS26_M_IO2LO_REQ                 (0x0001U << FS26_M_IO2LO_SHIFT)

/******************************************************************************/
/* M_AMUX_CTRL - Type: RW                                                     */
/******************************************************************************/
#define FS26_M_AMUX_CTRL_ADDR            0x13U
#define FS26_M_AMUX_CTRL_DEFAULT         0x0000U

/* AMUX Input Channel Selection */
#define FS26_M_AMUX_MASK                 0x001FU
#define FS26_M_AMUX_SHIFT                0x0000U
/* Selection of divider ratio */
#define FS26_M_AMUX_DIV_MASK             0x0020U
#define FS26_M_AMUX_DIV_SHIFT            0x0005U
/* Enable AMUX block */
#define FS26_M_AMUX_EN_MASK              0x0040U
#define FS26_M_AMUX_EN_SHIFT             0x0006U

/* Disabled with AMUX pin in Hi-Z */
#define FS26_M_AMUX_DISABLED             (0x0000U << FS26_M_AMUX_SHIFT)
/* Low Power Bangap1 */
#define FS26_M_AMUX_LP_BANDGAP           (0x0001U << FS26_M_AMUX_SHIFT)
/* Main Bandgap2 */
#define FS26_M_AMUX_MAIN_BANDGAP         (0x0002U << FS26_M_AMUX_SHIFT)
/* Fail Safe Bandgap */
#define FS26_M_AMUX_FS_BANDGAP           (0x0003U << FS26_M_AMUX_SHIFT)
/* Vana: Internal Main analog voltage supply */
#define FS26_M_AMUX_VANA                 (0x0004U << FS26_M_AMUX_SHIFT)
/* Vdig: internal Main digital voltage supply */
#define FS26_M_AMUX_VDIG                 (0x0005U << FS26_M_AMUX_SHIFT)
/* Vdig_fs: internal Fail Safe digital voltage supply */
#define FS26_M_AMUX_VDIG_FS              (0x0006U << FS26_M_AMUX_SHIFT)
/* VCORE Voltage */
#define FS26_M_AMUX_VCORE                (0x0007U << FS26_M_AMUX_SHIFT)
/* VPRE voltage */
#define FS26_M_AMUX_VPRE                 (0x0008U << FS26_M_AMUX_SHIFT)
/* LDO1 voltage */
#define FS26_M_AMUX_LDO1                 (0x0009U << FS26_M_AMUX_SHIFT)
/* LDO2 voltage */
#define FS26_M_AMUX_LDO2                 (0x000AU << FS26_M_AMUX_SHIFT)
/* VREF voltage */
#define FS26_M_AMUX_VREF                 (0x000BU << FS26_M_AMUX_SHIFT)
/* TRK1 voltage */
#define FS26_M_AMUX_TRK1                 (0x000CU << FS26_M_AMUX_SHIFT)
/* TRK2 voltage */
#define FS26_M_AMUX_TRK2                 (0x000DU << FS26_M_AMUX_SHIFT)
/* VDDIO voltage */
#define FS26_M_AMUX_VDDIO                (0x000EU << FS26_M_AMUX_SHIFT)
/* VBOS internal voltage */
#define FS26_M_AMUX_VBOS                 (0x000FU << FS26_M_AMUX_SHIFT)
/* VBST voltage (divider ratio configurable by SPI) */
#define FS26_M_AMUX_VBST                 (0x0010U << FS26_M_AMUX_SHIFT)
/* VSUP voltage (divider ratio configurable by SPI) */
#define FS26_M_AMUX_VSUP                 (0x0011U << FS26_M_AMUX_SHIFT)
/* WAKE1 voltage (divider ratio configurable by SPI) */
#define FS26_M_AMUX_WAKE1                (0x0012U << FS26_M_AMUX_SHIFT)
/* WAKE2 voltage (divider ratio configurable by SPI) */
#define FS26_M_AMUX_WAKE2                (0x0013U << FS26_M_AMUX_SHIFT)
/* GPIO1 voltage (divider ratio configurable by SPI) */
#define FS26_M_AMUX_GPIO1                (0x0014U << FS26_M_AMUX_SHIFT)
/* GPIO2 voltage (divider ratio configurable by SPI) */
#define FS26_M_AMUX_GPIO2                (0x0015U << FS26_M_AMUX_SHIFT)
/* BATSENSE voltage (divider ratio configurable by SPI) */
#define FS26_M_AMUX_BATSENSE             (0x0016U << FS26_M_AMUX_SHIFT)
/* Die Temperature Sensor T(�C) = [(VAMUX � VTEMP25) / VTEMP_COEFF ] + 25 */
#define FS26_M_AMUX_DIE_TEMP             (0x0017U << FS26_M_AMUX_SHIFT)
/* VCORE Temperature sensor */
#define FS26_M_AMUX_VCORE_TEMP           (0x0018U << FS26_M_AMUX_SHIFT)
/* VPRE Temperature sensor */
#define FS26_M_AMUX_VPRE_TEMP            (0x0019U << FS26_M_AMUX_SHIFT)
/* LDO1 Temperature sensor */
#define FS26_M_AMUX_LDO1_TEMP            (0x001AU << FS26_M_AMUX_SHIFT)
/* LDO2 Temperature sensor */
#define FS26_M_AMUX_LDO2_TEMP            (0x001BU << FS26_M_AMUX_SHIFT)
/* TRK1 Temperature sensor */
#define FS26_M_AMUX_TRK1_TEMP            (0x001CU << FS26_M_AMUX_SHIFT)
/* TRK2 Temperature sensor */
#define FS26_M_AMUX_TRK2_TEMP            (0x001DU << FS26_M_AMUX_SHIFT)
/* GPIO1 Temperature sensor */
#define FS26_M_AMUX_GPIO1_TEMP           (0x001EU << FS26_M_AMUX_SHIFT)
/* Reserved */
#define FS26_M_AMUX_RES                  (0x001FU << FS26_M_AMUX_SHIFT)

/* Divider ratio option 0 */
#define FS26_M_AMUX_DIV_0                (0x0000U << FS26_M_AMUX_DIV_SHIFT)
/* Divider ratio option 1 */
#define FS26_M_AMUX_DIV_1                (0x0001U << FS26_M_AMUX_DIV_SHIFT)

