nxp-appcodehub/dm-power-delivery-frdm-a-s32k344/src/drivers/inc/fs26_map.h
/* Enable AMUX block */
#define FS26_M_AMUX_EN_ENABLED           (0x0000U << FS26_M_AMUX_EN_SHIFT)
/* Disable AMUX block and pin is pulled-down to ground */
#define FS26_M_AMUX_EN_DISABLED          (0x0001U << FS26_M_AMUX_EN_SHIFT)

/******************************************************************************/
/* M_LDT_CFG1 - Type: RW                                                      */
/******************************************************************************/
#define FS26_M_LDT_CFG1_ADDR             0x14U
#define FS26_M_LDT_CFG1_DEFAULT          0x0000U

/* After running LDT timer value in NORMAL mode */
#define FS26_M_LDT_AFTER_RUN_MASK        0xFFFFU
#define FS26_M_LDT_AFTER_RUN_SHIFT       0x0000U

/******************************************************************************/
/* M_LDT_CFG2 - Type: RW                                                      */
/******************************************************************************/
#define FS26_M_LDT_CFG2_ADDR             0x15U
#define FS26_M_LDT_CFG2_DEFAULT          0x0000U

/* 16 less significant bits for the wake up with the Long Duration Timer */
#define FS26_M_LDT_WUP_L_MASK            0xFFFFU
#define FS26_M_LDT_WUP_L_SHIFT           0x0000U

/******************************************************************************/
/* M_LDT_CFG3 - Type: RW                                                      */
/******************************************************************************/
#define FS26_M_LDT_CFG3_ADDR             0x16U
#define FS26_M_LDT_CFG3_DEFAULT          0x0000U

/* 8 most significant bit for the wake up with the Long Duration Timer */
#define FS26_M_LDT_WUP_H_MASK            0x00FFU
#define FS26_M_LDT_WUP_H_SHIFT           0x0000U

/******************************************************************************/
/* M_LDT_CTRL - Type: RW                                                      */
/******************************************************************************/
#define FS26_M_LDT_CTRL_ADDR             0x17U
#define FS26_M_LDT_CTRL_DEFAULT          0x0000U

/* LDT Status */
#define FS26_M_LDT_RUN_MASK              0x0001U
#define FS26_M_LDT_RUN_SHIFT             0x0000U
/* Start LDT Timer operation */
#define FS26_M_LDT_EN_MASK               0x0002U
#define FS26_M_LDT_EN_SHIFT              0x0001U
/* Set operation mode */
#define FS26_M_LDT_MODE_MASK             0x0004U
#define FS26_M_LDT_MODE_SHIFT            0x0002U
/* LDT timer read selection */
#define FS26_M_LDT_SEL_MASK              0x0008U
#define FS26_M_LDT_SEL_SHIFT             0x0003U
/* LDT function selection */
#define FS26_M_LDT_FNCT_MASK             0x0070U
#define FS26_M_LDT_FNCT_SHIFT            0x0004U

/* LDT is disabled or not counting */
#define FS26_M_LDT_RUN_DISABLED          (0x0000U << FS26_M_LDT_RUN_SHIFT)
/* LDT is Enabled and count is in progress */
#define FS26_M_LDT_RUN_ENABLED           (0x0001U << FS26_M_LDT_RUN_SHIFT)

/* Disable LDT */
#define FS26_M_LDT_EN_DISABLED           (0x0000U << FS26_M_LDT_EN_SHIFT)
/* LDT starts counting */
#define FS26_M_LDT_EN_ENABLED            (0x0001U << FS26_M_LDT_EN_SHIFT)

/* Set LDT to long count */
#define FS26_M_LDT_MODE_LONG             (0x0000U << FS26_M_LDT_MODE_SHIFT)
/* Set LDT to short count */
#define FS26_M_LDT_MODE_SHORT            (0x0001U << FS26_M_LDT_MODE_SHIFT)

/* Read/Sets Target value of Wake-up LDT timer */
#define FS26_M_LDT_SEL_TARGET            (0x0000U << FS26_M_LDT_SEL_SHIFT)
/* Read real time value of 24-bit Timer */
#define FS26_M_LDT_SEL_REALTIME          (0x0001U << FS26_M_LDT_SEL_SHIFT)

/* Function 1 */
#define FS26_M_LDT_FNCT_1                (0x0000U << FS26_M_LDT_FNCT_SHIFT)
/* Function 2 */
#define FS26_M_LDT_FNCT_2                (0x0001U << FS26_M_LDT_FNCT_SHIFT)
/* Function 3 */
#define FS26_M_LDT_FNCT_3                (0x0002U << FS26_M_LDT_FNCT_SHIFT)
/* Function 4 */
#define FS26_M_LDT_FNCT_4                (0x0003U << FS26_M_LDT_FNCT_SHIFT)
/* Function 5 */
#define FS26_M_LDT_FNCT_5                (0x0004U << FS26_M_LDT_FNCT_SHIFT)
/* Reserved */
#define FS26_M_LDT_FNCT_RES_5            (0x0005U << FS26_M_LDT_FNCT_SHIFT)
/* Reserved */
#define FS26_M_LDT_FNCT_RES_6            (0x0006U << FS26_M_LDT_FNCT_SHIFT)
/* Reserved */
#define FS26_M_LDT_FNCT_RES_7            (0x0007U << FS26_M_LDT_FNCT_SHIFT)

/******************************************************************************/
/* M_MEMORY0 - Type: RW                                                       */
/******************************************************************************/
#define FS26_M_MEMORY0_ADDR              0x18U
#define FS26_M_MEMORY0_DEFAULT           0x0000U

/* Free 16 bits for application data storage, MEM0 stored data */
#define FS26_M_MEM0_MASK                 0xFFFFU
#define FS26_M_MEM0_SHIFT                0x0000U

/******************************************************************************/
/* M_MEMORY1 - Type: RW                                                       */
/******************************************************************************/
#define FS26_M_MEMORY1_ADDR              0x19U
#define FS26_M_MEMORY1_DEFAULT           0x0000U

/* Free 16 bits for application data storage, MEM1 stored data */
#define FS26_M_MEM1_MASK                 0xFFFFU
#define FS26_M_MEM1_SHIFT                0x0000U

/******************************************************************************/
/* FS_GRL_FLAGS - Type: R                                                     */
/******************************************************************************/
#define FS26_FS_GRL_FLAGS_ADDR           0x00U
#define FS26_FS_GRL_FLAGS_DEFAULT        0x0000U

/* Report an issue on BIST (Logical or Analog) */
#define FS26_FS_FS_BIST_G_MASK           0x0800U
#define FS26_FS_FS_BIST_G_SHIFT          0x000BU
/* Report an issue in one of the voltage monitoring (OV or UV) */
#define FS26_FS_FS_REG_OVUV_G_MASK       0x1000U
#define FS26_FS_FS_REG_OVUV_G_SHIFT      0x000CU
/* Report an issue in one of the Fail Safe IOs */
#define FS26_FS_FS_IO_G_MASK             0x2000U
#define FS26_FS_FS_IO_G_SHIFT            0x000DU
/* Report an issue on the Watchdog Refresh */
#define FS26_FS_FS_WD_G_MASK             0x4000U
#define FS26_FS_FS_WD_G_SHIFT            0x000EU
/* Report an issue in the communication (SPI) */
#define FS26_FS_FS_COM_G_MASK            0x8000U
#define FS26_FS_FS_COM_G_SHIFT           0x000FU

/* No Failure */
#define FS26_FS_FS_BIST_G_NO_FAILURE     (0x0000U << FS26_FS_FS_BIST_G_SHIFT)
/* Failure */
#define FS26_FS_FS_BIST_G_FAILURE        (0x0001U << FS26_FS_FS_BIST_G_SHIFT)

/* No Failure */
#define FS26_FS_FS_REG_OVUV_G_NO_FAILURE (0x0000U << FS26_FS_FS_REG_OVUV_G_SHIFT)
/* Failure */
#define FS26_FS_FS_REG_OVUV_G_FAILURE    (0x0001U << FS26_FS_FS_REG_OVUV_G_SHIFT)

/* No Failure */
#define FS26_FS_FS_IO_G_NO_FAILURE       (0x0000U << FS26_FS_FS_IO_G_SHIFT)
/* Failure */
#define FS26_FS_FS_IO_G_FAILURE          (0x0001U << FS26_FS_FS_IO_G_SHIFT)

