nxp-appcodehub/dm-power-delivery-frdm-a-s32k344/src/drivers/inc/fs26_map.h
/* Good WD Refresh */
#define FS26_FS_FS_WD_G_GOOD_REFRESH     (0x0000U << FS26_FS_FS_WD_G_SHIFT)
/* Bad WD Refresh */
#define FS26_FS_FS_WD_G_BAD_REFRESH      (0x0001U << FS26_FS_FS_WD_G_SHIFT)

/* No Failure */
#define FS26_FS_FS_COM_G_NO_FAILURE      (0x0000U << FS26_FS_FS_COM_G_SHIFT)
/* Failure */
#define FS26_FS_FS_COM_G_FAILURE         (0x0001U << FS26_FS_FS_COM_G_SHIFT)

/******************************************************************************/
/* FS_I_OVUV_SAFE_REACTION1 - Type: RW                                        */
/******************************************************************************/
#define FS26_FS_I_OVUV_SAFE_REACTION1_ADDR    0x01U
#define FS26_FS_I_OVUV_SAFE_REACTION1_DEFAULT 0x9999U

/* Reaction on RSTB or FAIL SAFE outputs in case of UV detection on VMON_LDO2 */
#define FS26_FS_VMON_LDO2_UV_FS_REACTION_MASK  0x0003U
#define FS26_FS_VMON_LDO2_UV_FS_REACTION_SHIFT 0x0000U
/* Reaction on RSTB or FAIL SAFE outputs in case of OV detection on VMON_LDO2 */
#define FS26_FS_VMON_LDO2_OV_FS_REACTION_MASK  0x000CU
#define FS26_FS_VMON_LDO2_OV_FS_REACTION_SHIFT 0x0002U
/* Reaction on RSTB or FAIL SAFE outputs in case of UV detection on VMON_LDO1 */
#define FS26_FS_VMON_LDO1_UV_FS_REACTION_MASK  0x0030U
#define FS26_FS_VMON_LDO1_UV_FS_REACTION_SHIFT 0x0004U
/* Reaction on RSTB or FAIL SAFE outputs in case of OV detection on VMON_LDO1 */
#define FS26_FS_VMON_LDO1_OV_FS_REACTION_MASK  0x00C0U
#define FS26_FS_VMON_LDO1_OV_FS_REACTION_SHIFT 0x0006U
/* Reaction on RSTB or FAIL SAFE outputs in case of UV detection on VMON_CORE */
#define FS26_FS_VMON_CORE_UV_FS_REACTION_MASK  0x0300U
#define FS26_FS_VMON_CORE_UV_FS_REACTION_SHIFT 0x0008U
/* Reaction on RSTB or FAIL SAFE outputs in case of OV detection on VMON_CORE */
#define FS26_FS_VMON_CORE_OV_FS_REACTION_MASK  0x0C00U
#define FS26_FS_VMON_CORE_OV_FS_REACTION_SHIFT 0x000AU
/* Reaction on RSTB or FAIL SAFE outputs in case of UV detection on VMON_PRE */
#define FS26_FS_VMON_PRE_UV_FS_REACTION_MASK   0x3000U
#define FS26_FS_VMON_PRE_UV_FS_REACTION_SHIFT  0x000CU
/* Reaction on RSTB or FAIL SAFE outputs in case of OV detection on VMON_PRE */
#define FS26_FS_VMON_PRE_OV_FS_REACTION_MASK   0xC000U
#define FS26_FS_VMON_PRE_OV_FS_REACTION_SHIFT  0x000EU

/* No effect on RSTb and FS0b */
#define FS26_FS_VMON_LDO2_UV_FS_REACTION_NO_EFFECT (0x0000U << FS26_FS_VMON_LDO2_UV_FS_REACTION_SHIFT)
/* VMON_LDO2 UV asserts FS0b only */
#define FS26_FS_VMON_LDO2_UV_FS_REACTION_FS0B      (0x0001U << FS26_FS_VMON_LDO2_UV_FS_REACTION_SHIFT)
/* VMON_LDO2 UV asserts RSTb and FS0b */
#define FS26_FS_VMON_LDO2_UV_FS_REACTION_RSTB_FS0B (0x0002U << FS26_FS_VMON_LDO2_UV_FS_REACTION_SHIFT)

/* No effect on RSTb and FS0b */
#define FS26_FS_VMON_LDO2_OV_FS_REACTION_NO_EFFECT (0x0000U << FS26_FS_VMON_LDO2_OV_FS_REACTION_SHIFT)
/* VMON_LDO2 OV asserts FS0b only */
#define FS26_FS_VMON_LDO2_OV_FS_REACTION_FS0B      (0x0001U << FS26_FS_VMON_LDO2_OV_FS_REACTION_SHIFT)
/* VMON_LDO2 OV asserts RSTb and FS0b */
#define FS26_FS_VMON_LDO2_OV_FS_REACTION_RSTB_FS0B (0x0002U << FS26_FS_VMON_LDO2_OV_FS_REACTION_SHIFT)

/* No effect on RSTb and FS0b */
#define FS26_FS_VMON_LDO1_UV_FS_REACTION_NO_EFFECT (0x0000U << FS26_FS_VMON_LDO1_UV_FS_REACTION_SHIFT)
/* VMON_LDO1 UV asserts FS0b only */
#define FS26_FS_VMON_LDO1_UV_FS_REACTION_FS0B      (0x0001U << FS26_FS_VMON_LDO1_UV_FS_REACTION_SHIFT)
/* VMON_LDO1 UV asserts RSTb and FS0b */
#define FS26_FS_VMON_LDO1_UV_FS_REACTION_RSTB_FS0B (0x0002U << FS26_FS_VMON_LDO1_UV_FS_REACTION_SHIFT)

/* No effect on RSTb and FS0b */
#define FS26_FS_VMON_LDO1_OV_FS_REACTION_NO_EFFECT (0x0000U << FS26_FS_VMON_LDO1_OV_FS_REACTION_SHIFT)
/* VMON_LDO1 OV asserts FS0b only */
#define FS26_FS_VMON_LDO1_OV_FS_REACTION_FS0B      (0x0001U << FS26_FS_VMON_LDO1_OV_FS_REACTION_SHIFT)
/* VMON_LDO1 OV asserts RSTb and FS0b */
#define FS26_FS_VMON_LDO1_OV_FS_REACTION_RSTB_FS0B (0x0002U << FS26_FS_VMON_LDO1_OV_FS_REACTION_SHIFT)

/* No effect on RSTb and FS0b */
#define FS26_FS_VMON_CORE_UV_FS_REACTION_NO_EFFECT (0x0000U << FS26_FS_VMON_CORE_UV_FS_REACTION_SHIFT)
/* VMON_CORE UV asserts FS0b only */
#define FS26_FS_VMON_CORE_UV_FS_REACTION_FS0B      (0x0001U << FS26_FS_VMON_CORE_UV_FS_REACTION_SHIFT)
/* VMON_CORE UV asserts RSTb and FS0b */
#define FS26_FS_VMON_CORE_UV_FS_REACTION_RSTB_FS0B (0x0002U << FS26_FS_VMON_CORE_UV_FS_REACTION_SHIFT)

/* No effect on RSTb and FS0b */
#define FS26_FS_VMON_CORE_OV_FS_REACTION_NO_EFFECT (0x0000U << FS26_FS_VMON_CORE_OV_FS_REACTION_SHIFT)
/* VMON_CORE OV asserts FS0b only */
#define FS26_FS_VMON_CORE_OV_FS_REACTION_FS0B      (0x0001U << FS26_FS_VMON_CORE_OV_FS_REACTION_SHIFT)
/* VMON_CORE OV asserts RSTb and FS0b */
#define FS26_FS_VMON_CORE_OV_FS_REACTION_RSTB_FS0B (0x0002U << FS26_FS_VMON_CORE_OV_FS_REACTION_SHIFT)

/* No effect on RSTb and FS0b */
#define FS26_FS_VMON_PRE_UV_FS_REACTION_NO_EFFECT  (0x0000U << FS26_FS_VMON_PRE_UV_FS_REACTION_SHIFT)
/* VMON_PRE UV asserts FS0b only */
#define FS26_FS_VMON_PRE_UV_FS_REACTION_FS0B       (0x0001U << FS26_FS_VMON_PRE_UV_FS_REACTION_SHIFT)
/* VMON_PRE UV asserts RSTb and FS0b */
#define FS26_FS_VMON_PRE_UV_FS_REACTION_RSTB_FS0B  (0x0002U << FS26_FS_VMON_PRE_UV_FS_REACTION_SHIFT)

/* No effect on RSTb and FS0b */
#define FS26_FS_VMON_PRE_OV_FS_REACTION_NO_EFFECT  (0x0000U << FS26_FS_VMON_PRE_OV_FS_REACTION_SHIFT)
/* VMON_PRE OV asserts FS0b only */
#define FS26_FS_VMON_PRE_OV_FS_REACTION_FS0B       (0x0001U << FS26_FS_VMON_PRE_OV_FS_REACTION_SHIFT)
/* VMON_PRE OV asserts RSTb and FS0b */
#define FS26_FS_VMON_PRE_OV_FS_REACTION_RSTB_FS0B  (0x0002U << FS26_FS_VMON_PRE_OV_FS_REACTION_SHIFT)

/******************************************************************************/
/* FS_I_OVUV_SAFE_REACTION2 - Type: RW                                        */
/******************************************************************************/
#define FS26_FS_I_OVUV_SAFE_REACTION2_ADDR    0x03U
#define FS26_FS_I_OVUV_SAFE_REACTION2_DEFAULT 0x9999U

/* Reaction on RSTB or FAIL SAFE outputs in case of UV detection on VMON_TRK1 */
#define FS26_FS_VMON_TRK1_UV_FS_REACTION_MASK  0x0003U
#define FS26_FS_VMON_TRK1_UV_FS_REACTION_SHIFT 0x0000U
/* Reaction on RSTB or FAIL SAFE outputs in case of OV detection on VMON_TRK1 */
#define FS26_FS_VMON_TRK1_OV_FS_REACTION_MASK  0x000CU
#define FS26_FS_VMON_TRK1_OV_FS_REACTION_SHIFT 0x0002U
/* Reaction on RSTB or FAIL SAFE outputs in case of UV detection on VMON_TRK2 */
#define FS26_FS_VMON_TRK2_UV_FS_REACTION_MASK  0x0030U
#define FS26_FS_VMON_TRK2_UV_FS_REACTION_SHIFT 0x0004U
/* Reaction on RSTB or FAIL SAFE outputs in case of OV detection on VMON_TRK2 */
#define FS26_FS_VMON_TRK2_OV_FS_REACTION_MASK  0x00C0U
#define FS26_FS_VMON_TRK2_OV_FS_REACTION_SHIFT 0x0006U
/* Reaction on RSTB or FAIL SAFE outputs in case of UV detection on VMON_REF */
#define FS26_FS_VMON_REF_UV_FS_REACTION_MASK   0x0300U
#define FS26_FS_VMON_REF_UV_FS_REACTION_SHIFT  0x0008U
/* Reaction on RSTB or FAIL SAFE outputs in case of OV detection on VMON_REF */
#define FS26_FS_VMON_REF_OV_FS_REACTION_MASK   0x0C00U
#define FS26_FS_VMON_REF_OV_FS_REACTION_SHIFT  0x000AU
/* Reaction on RSTB or FAIL SAFE outputs in case of UV detection on VMON_EXT */
#define FS26_FS_VMON_EXT_UV_FS_REACTION_MASK   0x3000U
#define FS26_FS_VMON_EXT_UV_FS_REACTION_SHIFT  0x000CU
/* Reaction on RSTB or FAIL SAFE outputs in case of OV detection on VMON_EXT */
#define FS26_FS_VMON_EXT_OV_FS_REACTION_MASK   0xC000U
#define FS26_FS_VMON_EXT_OV_FS_REACTION_SHIFT  0x000EU

/* No effect on RSTb and FS0b */
#define FS26_FS_VMON_TRK1_UV_FS_REACTION_NO_EFFECT (0x0000U << FS26_FS_VMON_TRK1_UV_FS_REACTION_SHIFT)
/* VMON_TRK1 UV asserts FS0b only */
#define FS26_FS_VMON_TRK1_UV_FS_REACTION_FS0B      (0x0001U << FS26_FS_VMON_TRK1_UV_FS_REACTION_SHIFT)
/* VMON_TRK1 UV asserts RSTb and FS0b */
#define FS26_FS_VMON_TRK1_UV_FS_REACTION_RSTB_FS0B (0x0002U << FS26_FS_VMON_TRK1_UV_FS_REACTION_SHIFT)

/* No effect on RSTb and FS0b */
#define FS26_FS_VMON_TRK1_OV_FS_REACTION_NO_EFFECT (0x0000U << FS26_FS_VMON_TRK1_OV_FS_REACTION_SHIFT)
/* VMON_TRK1 OV asserts FS0b only */
#define FS26_FS_VMON_TRK1_OV_FS_REACTION_FS0B      (0x0001U << FS26_FS_VMON_TRK1_OV_FS_REACTION_SHIFT)
/* VMON_TRK1 OV asserts RSTb and FS0b */
#define FS26_FS_VMON_TRK1_OV_FS_REACTION_RSTB_FS0B (0x0002U << FS26_FS_VMON_TRK1_OV_FS_REACTION_SHIFT)

/* No effect on RSTb and FS0b */
#define FS26_FS_VMON_TRK2_UV_FS_REACTION_NO_EFFECT (0x0000U << FS26_FS_VMON_TRK2_UV_FS_REACTION_SHIFT)
/* VMON_TRK2 UV asserts FS0b only */
#define FS26_FS_VMON_TRK2_UV_FS_REACTION_FS0B      (0x0001U << FS26_FS_VMON_TRK2_UV_FS_REACTION_SHIFT)
/* VMON_TRK2 UV asserts RSTb and FS0b */
#define FS26_FS_VMON_TRK2_UV_FS_REACTION_RSTB_FS0B (0x0002U << FS26_FS_VMON_TRK2_UV_FS_REACTION_SHIFT)

/* No effect on RSTb and FS0b */
#define FS26_FS_VMON_TRK2_OV_FS_REACTION_NO_EFFECT (0x0000U << FS26_FS_VMON_TRK2_OV_FS_REACTION_SHIFT)
/* VMON_TRK2 OV asserts FS0b only */
#define FS26_FS_VMON_TRK2_OV_FS_REACTION_FS0B      (0x0001U << FS26_FS_VMON_TRK2_OV_FS_REACTION_SHIFT)
/* VMON_TRK2 OV asserts RSTb and FS0b */
#define FS26_FS_VMON_TRK2_OV_FS_REACTION_RSTB_FS0B (0x0002U << FS26_FS_VMON_TRK2_OV_FS_REACTION_SHIFT)

/* No effect on RSTb and FS0b */
#define FS26_FS_VMON_REF_UV_FS_REACTION_NO_EFFECT  (0x0000U << FS26_FS_VMON_REF_UV_FS_REACTION_SHIFT)
/* VMON_REF UV asserts FS0b only */
#define FS26_FS_VMON_REF_UV_FS_REACTION_FS0B       (0x0001U << FS26_FS_VMON_REF_UV_FS_REACTION_SHIFT)
/* VMON_REF UV asserts RSTb and FS0b */
#define FS26_FS_VMON_REF_UV_FS_REACTION_RSTB_FS0B  (0x0002U << FS26_FS_VMON_REF_UV_FS_REACTION_SHIFT)

/* No effect on RSTb and FS0b */
#define FS26_FS_VMON_REF_OV_FS_REACTION_NO_EFFECT  (0x0000U << FS26_FS_VMON_REF_OV_FS_REACTION_SHIFT)
/* VMON_REF OV asserts FS0b only */
#define FS26_FS_VMON_REF_OV_FS_REACTION_FS0B       (0x0001U << FS26_FS_VMON_REF_OV_FS_REACTION_SHIFT)
/* VMON_REF OV asserts RSTb and FS0b */
#define FS26_FS_VMON_REF_OV_FS_REACTION_RSTB_FS0B  (0x0002U << FS26_FS_VMON_REF_OV_FS_REACTION_SHIFT)

/* No effect on RSTb and FS0b */
#define FS26_FS_VMON_EXT_UV_FS_REACTION_NO_EFFECT  (0x0000U << FS26_FS_VMON_EXT_UV_FS_REACTION_SHIFT)
/* VMON_EXT UV asserts FS0b only */
#define FS26_FS_VMON_EXT_UV_FS_REACTION_FS0B       (0x0001U << FS26_FS_VMON_EXT_UV_FS_REACTION_SHIFT)
/* VMON_EXT UV asserts RSTb and FS0b */
#define FS26_FS_VMON_EXT_UV_FS_REACTION_RSTB_FS0B  (0x0002U << FS26_FS_VMON_EXT_UV_FS_REACTION_SHIFT)

/* No effect on RSTb and FS0b */
#define FS26_FS_VMON_EXT_OV_FS_REACTION_NO_EFFECT  (0x0000U << FS26_FS_VMON_EXT_OV_FS_REACTION_SHIFT)
/* VMON_EXT OV asserts FS0b only */
#define FS26_FS_VMON_EXT_OV_FS_REACTION_FS0B       (0x0001U << FS26_FS_VMON_EXT_OV_FS_REACTION_SHIFT)
/* VMON_EXT OV asserts RSTb and FS0b */
#define FS26_FS_VMON_EXT_OV_FS_REACTION_RSTB_FS0B  (0x0002U << FS26_FS_VMON_EXT_OV_FS_REACTION_SHIFT)

/******************************************************************************/
/* FS_I_WD_CFG - Type: RW                                                     */
/******************************************************************************/
#define FS26_FS_I_WD_CFG_ADDR            0x05U
#define FS26_FS_I_WD_CFG_DEFAULT         0x4200U

/* Reflect the value of the Watchdog Error Counter */
#define FS26_FS_WD_ERR_CNT_MASK          0x000FU
#define FS26_FS_WD_ERR_CNT_SHIFT         0x0000U
/* Reflect the value of the Watchdog Refresh Counter */
#define FS26_FS_WD_RFR_CNT_MASK          0x0070U
#define FS26_FS_WD_RFR_CNT_SHIFT         0x0004U
/* Reaction on RSTB or FAIL SAFE output in case of BAD Watchdog (data or timing) */
#define FS26_FS_WD_FS_REACTION_MASK      0x0300U
#define FS26_FS_WD_FS_REACTION_SHIFT     0x0008U
/* Watchdog refresh counter configuration */
#define FS26_FS_WD_RFR_LIMIT_MASK        0x1800U
#define FS26_FS_WD_RFR_LIMIT_SHIFT       0x000BU
/* Watchdog error counter configuration */
#define FS26_FS_WD_ERR_LIMIT_MASK        0xC000U
#define FS26_FS_WD_ERR_LIMIT_SHIFT       0x000EU

/* 0 */
#define FS26_FS_WD_ERR_CNT_0             (0x0000U << FS26_FS_WD_ERR_CNT_SHIFT)
/* 1 */
#define FS26_FS_WD_ERR_CNT_1             (0x0001U << FS26_FS_WD_ERR_CNT_SHIFT)
/* 2 */
#define FS26_FS_WD_ERR_CNT_2             (0x0002U << FS26_FS_WD_ERR_CNT_SHIFT)
/* 3 */
#define FS26_FS_WD_ERR_CNT_3             (0x0003U << FS26_FS_WD_ERR_CNT_SHIFT)
/* 4 */
#define FS26_FS_WD_ERR_CNT_4             (0x0004U << FS26_FS_WD_ERR_CNT_SHIFT)
/* 5 */
#define FS26_FS_WD_ERR_CNT_5             (0x0005U << FS26_FS_WD_ERR_CNT_SHIFT)
/* 6 */
#define FS26_FS_WD_ERR_CNT_6             (0x0006U << FS26_FS_WD_ERR_CNT_SHIFT)
/* 7 */
#define FS26_FS_WD_ERR_CNT_7             (0x0007U << FS26_FS_WD_ERR_CNT_SHIFT)
/* 8 */
#define FS26_FS_WD_ERR_CNT_8             (0x0008U << FS26_FS_WD_ERR_CNT_SHIFT)
/* 9 */
#define FS26_FS_WD_ERR_CNT_9             (0x0009U << FS26_FS_WD_ERR_CNT_SHIFT)
/* 10 */
#define FS26_FS_WD_ERR_CNT_10            (0x000AU << FS26_FS_WD_ERR_CNT_SHIFT)
/* 11 */
#define FS26_FS_WD_ERR_CNT_11            (0x000BU << FS26_FS_WD_ERR_CNT_SHIFT)
/* 12 */
#define FS26_FS_WD_ERR_CNT_12            (0x000CU << FS26_FS_WD_ERR_CNT_SHIFT)

/* 0 */
#define FS26_FS_WD_RFR_CNT_0             (0x0000U << FS26_FS_WD_RFR_CNT_SHIFT)
/* 1 */
#define FS26_FS_WD_RFR_CNT_1             (0x0001U << FS26_FS_WD_RFR_CNT_SHIFT)
/* 2 */
#define FS26_FS_WD_RFR_CNT_2             (0x0002U << FS26_FS_WD_RFR_CNT_SHIFT)
/* 3 */
#define FS26_FS_WD_RFR_CNT_3             (0x0003U << FS26_FS_WD_RFR_CNT_SHIFT)
/* 4 */
#define FS26_FS_WD_RFR_CNT_4             (0x0004U << FS26_FS_WD_RFR_CNT_SHIFT)
/* 5 */
#define FS26_FS_WD_RFR_CNT_5             (0x0005U << FS26_FS_WD_RFR_CNT_SHIFT)
/* 6 */
#define FS26_FS_WD_RFR_CNT_6             (0x0006U << FS26_FS_WD_RFR_CNT_SHIFT)
/* 7 */
#define FS26_FS_WD_RFR_CNT_7             (0x0007U << FS26_FS_WD_RFR_CNT_SHIFT)

