nxp-appcodehub/dm-power-delivery-frdm-a-s32k344/src/drivers/inc/fs26_map.h
/* No action on RSTb and FS0b */
#define FS26_FS_WD_FS_REACTION_NO_EFFECT (0x0000U << FS26_FS_WD_FS_REACTION_SHIFT)
/* FS0b only is asserted low */
#define FS26_FS_WD_FS_REACTION_FS0B      (0x0001U << FS26_FS_WD_FS_REACTION_SHIFT)
/* RSTb and FS0b are asserted low */
#define FS26_FS_WD_FS_REACTION_RSTB_FS0B (0x0002U << FS26_FS_WD_FS_REACTION_SHIFT)

/* 6 */
#define FS26_FS_WD_RFR_LIMIT_6           (0x0000U << FS26_FS_WD_RFR_LIMIT_SHIFT)
/* 4 */
#define FS26_FS_WD_RFR_LIMIT_4           (0x0001U << FS26_FS_WD_RFR_LIMIT_SHIFT)
/* 2 */
#define FS26_FS_WD_RFR_LIMIT_2           (0x0002U << FS26_FS_WD_RFR_LIMIT_SHIFT)
/* 1 */
#define FS26_FS_WD_RFR_LIMIT_1           (0x0003U << FS26_FS_WD_RFR_LIMIT_SHIFT)

/* 8 */
#define FS26_FS_WD_ERR_LIMIT_8           (0x0000U << FS26_FS_WD_ERR_LIMIT_SHIFT)
/* 6 */
#define FS26_FS_WD_ERR_LIMIT_6           (0x0001U << FS26_FS_WD_ERR_LIMIT_SHIFT)
/* 4 */
#define FS26_FS_WD_ERR_LIMIT_4           (0x0002U << FS26_FS_WD_ERR_LIMIT_SHIFT)
/* 2 */
#define FS26_FS_WD_ERR_LIMIT_2           (0x0003U << FS26_FS_WD_ERR_LIMIT_SHIFT)

/******************************************************************************/
/* FS_I_SAFE_INPUTS - Type: RW                                                */
/******************************************************************************/
#define FS26_FS_I_SAFE_INPUTS_ADDR       0x07U
#define FS26_FS_I_SAFE_INPUTS_DEFAULT    0x238DU

/* FCCU pin filtering time settings */
#define FS26_FS_FCCU12_FILT_MASK          0x0003U
#define FS26_FS_FCCU12_FILT_SHIFT         0x0000U
/* Reaction on RSTb or Fail Safe output in case of fault detection on ERRMON */
#define FS26_FS_ERRMON_FS_REACTION_MASK   0x0004U
#define FS26_FS_ERRMON_FS_REACTION_SHIFT  0x0002U
/* Acknowledge timing following a fault detection on ERRMON */
#define FS26_FS_ERRMON_ACK_TIME_MASK      0x0018U
#define FS26_FS_ERRMON_ACK_TIME_SHIFT     0x0003U
/* ERRMON Fault Polarity */
#define FS26_FS_ERRMON_FLT_POLARITY_MASK  0x0020U
#define FS26_FS_ERRMON_FLT_POLARITY_SHIFT 0x0005U
/* WAKE2 Low Power mode request polarity */
#define FS26_FS_WAKE2_LP_POLARITY_MASK    0x0040U
#define FS26_FS_WAKE2_LP_POLARITY_SHIFT   0x0006U
/* Reaction on RSTB or FAIL SAFE output in case of fault detection on FCCU2 */
#define FS26_FS_FCCU2_FS_REACTION_MASK    0x0080U
#define FS26_FS_FCCU2_FS_REACTION_SHIFT   0x0007U
/* Reaction on RSTB or FAIL SAFE output in case of fault detection on FCCU1 */
#define FS26_FS_FCCU1_FS_REACTION_MASK    0x0100U
#define FS26_FS_FCCU1_FS_REACTION_SHIFT   0x0008U
/* Reaction on RSTB or FAIL SAFE output in case of fault detection on FCCU12 */
#define FS26_FS_FCCU12_FS_REACTION_MASK   0x0200U
#define FS26_FS_FCCU12_FS_REACTION_SHIFT  0x0009U
/* FCCU2 fault polarity */
#define FS26_FS_FCCU2_FLT_POL_MASK        0x0400U
#define FS26_FS_FCCU2_FLT_POL_SHIFT       0x000AU
/* FCCU1 fault polarity */
#define FS26_FS_FCCU1_FLT_POL_MASK        0x0800U
#define FS26_FS_FCCU1_FLT_POL_SHIFT       0x000BU
/* FCCU12 fault polarity */
#define FS26_FS_FCCU12_FLT_POL_MASK       0x1000U
#define FS26_FS_FCCU12_FLT_POL_SHIFT      0x000CU
/* FCCU monitoring configuration */
#define FS26_FS_FCCU_CFG_MASK             0xE000U
#define FS26_FS_FCCU_CFG_SHIFT            0x000DU

/* 3us */
#define FS26_FS_FCCU12_FILT_3US          (0x0000U << FS26_FS_FCCU12_FILT_SHIFT)
/* 6us */
#define FS26_FS_FCCU12_FILT_6US          (0x0001U << FS26_FS_FCCU12_FILT_SHIFT)
/* 10us */
#define FS26_FS_FCCU12_FILT_10US         (0x0002U << FS26_FS_FCCU12_FILT_SHIFT)
/* 20us */
#define FS26_FS_FCCU12_FILT_20US         (0x0003U << FS26_FS_FCCU12_FILT_SHIFT)

/* FS0b only is asserted low in case of fault detection on ERMRON */
#define FS26_FS_ERRMON_FS_REACTION_FS0B      (0x0000U << FS26_FS_ERRMON_FS_REACTION_SHIFT)
/* RSTb and FS0b only is asserted low in case of fault detected on ERRMON */
#define FS26_FS_ERRMON_FS_REACTION_RSTB_FS0B (0x0001U << FS26_FS_ERRMON_FS_REACTION_SHIFT)

/* 1 ms */
#define FS26_FS_ERRMON_ACK_TIME_1MS      (0x0000U << FS26_FS_ERRMON_ACK_TIME_SHIFT)
/* 8 ms */
#define FS26_FS_ERRMON_ACK_TIME_8MS      (0x0001U << FS26_FS_ERRMON_ACK_TIME_SHIFT)
/* 16 ms */
#define FS26_FS_ERRMON_ACK_TIME_16MS     (0x0002U << FS26_FS_ERRMON_ACK_TIME_SHIFT)
/* 32 ms */
#define FS26_FS_ERRMON_ACK_TIME_32MS     (0x0003U << FS26_FS_ERRMON_ACK_TIME_SHIFT)

/* Low level is a fault after a negative edge transition */
#define FS26_FS_ERRMON_FLT_POLARITY_LOW  (0x0000U << FS26_FS_ERRMON_FLT_POLARITY_SHIFT)
/* High level is a fault after a positive edge transition */
#define FS26_FS_ERRMON_FLT_POLARITY_HIGH (0x0001U << FS26_FS_ERRMON_FLT_POLARITY_SHIFT)

/* Go to LP modes when WAKE2 goes low */
#define FS26_FS_WAKE2_LP_POLARITY_LOW    (0x0000U << FS26_FS_WAKE2_LP_POLARITY_SHIFT)
/* Go to LP modes when WAKE2 goes high */
#define FS26_FS_WAKE2_LP_POLARITY_HIGH   (0x0001U << FS26_FS_WAKE2_LP_POLARITY_SHIFT)

/* FS0b only is asserted low in case of fault on FCCU2 */
#define FS26_FS_FCCU2_FS_REACTION_FS0B      (0x0000U << FS26_FS_FCCU2_FS_REACTION_SHIFT)
/* RSTB and FS0b only is asserted low in case of fault on FCCU2 */
#define FS26_FS_FCCU2_FS_REACTION_RSTB_FS0B (0x0001U << FS26_FS_FCCU2_FS_REACTION_SHIFT)

/* FS0b only is asserted low in case of fault on FCCU1 */
#define FS26_FS_FCCU1_FS_REACTION_FS0B      (0x0000U << FS26_FS_FCCU1_FS_REACTION_SHIFT)
/* RSTB and FS0b only is asserted low in case of fault on FCCU1 */
#define FS26_FS_FCCU1_FS_REACTION_RSTB_FS0B (0x0001U << FS26_FS_FCCU1_FS_REACTION_SHIFT)

/* FS0b only is asserted low in case of fault on FCCU1 and FCCU2 */
#define FS26_FS_FCCU12_FS_REACTION_FS0B      (0x0000U << FS26_FS_FCCU12_FS_REACTION_SHIFT)
/* RSTB and FS0b only is asserted low in case of fault on FCCU1 and FCCU2 */
#define FS26_FS_FCCU12_FS_REACTION_RSTB_FS0B (0x0001U << FS26_FS_FCCU12_FS_REACTION_SHIFT)

/* Low level is a fault */
#define FS26_FS_FCCU2_FLT_POL_LOW        (0x0000U << FS26_FS_FCCU2_FLT_POL_SHIFT)
/* High level is a fault */
#define FS26_FS_FCCU2_FLT_POL_HIGH       (0x0001U << FS26_FS_FCCU2_FLT_POL_SHIFT)

/* Low level is a fault */
#define FS26_FS_FCCU1_FLT_POL_LOW        (0x0000U << FS26_FS_FCCU1_FLT_POL_SHIFT)
/* High level is a fault */
#define FS26_FS_FCCU1_FLT_POL_HIGH       (0x0001U << FS26_FS_FCCU1_FLT_POL_SHIFT)

/* FCCU1=0 or FCCU2=1 level is a fault */
#define FS26_FS_FCCU12_FLT_POL_0_1       (0x0000U << FS26_FS_FCCU12_FLT_POL_SHIFT)
/* FCCU1=1 or FCCU2=0 level is a fault */
#define FS26_FS_FCCU12_FLT_POL_1_0       (0x0001U << FS26_FS_FCCU12_FLT_POL_SHIFT)

/* No monitoring */
#define FS26_FS_FCCU_CFG_NO              (0x0000U << FS26_FS_FCCU_CFG_SHIFT)
/* FCCU1 and FCCU2 inputs monitoring activated by pair (Bi-Stable protocol) */
#define FS26_FS_FCCU_CFG_PAIR            (0x0001U << FS26_FS_FCCU_CFG_SHIFT)
/* FCCU1 or FCCU2 single input monitoring activated */
#define FS26_FS_FCCU_CFG_SINGLE          (0x0002U << FS26_FS_FCCU_CFG_SHIFT)
/* FCCU1 input monitoring only, FCCU2 input not used */
#define FS26_FS_FCCU_CFG_FCCU1           (0x0003U << FS26_FS_FCCU_CFG_SHIFT)
/* FCCU2 input monitoring only, FCCU1 input not used */
#define FS26_FS_FCCU_CFG_FCCU2           (0x0004U << FS26_FS_FCCU_CFG_SHIFT)
/* FCCU1 or FCCU2 single input PWM monitoring activated */
#define FS26_FS_FCCU_CFG_SINGLE_PWM      (0x0005U << FS26_FS_FCCU_CFG_SHIFT)
/* FCCU1 input PWM monitoring only, FCCU1 input level monitoring */
#define FS26_FS_FCCU_CFG_FCCU1_PWM       (0x0006U << FS26_FS_FCCU_CFG_SHIFT)
/* FCCU2 input PWM monitoring only, FCCU2 input level monitoring */
#define FS26_FS_FCCU_CFG_FCCU2_PWM       (0x0007U << FS26_FS_FCCU_CFG_SHIFT)

/******************************************************************************/
/* FS_I_FSSM - Type: RW                                                       */
/******************************************************************************/
#define FS26_FS_I_FSSM_ADDR              0x09U
#define FS26_FS_I_FSSM_DEFAULT           0x50C1U

