nxp-appcodehub/dm-power-delivery-frdm-a-s32k344/src/drivers/inc/fs26_map.h
/* Reflect the value of the Fault Error Counter */
#define FS26_FS_FLT_ERR_CNT_MASK         0x000FU
#define FS26_FS_FLT_ERR_CNT_SHIFT        0x0000U
/* Disable 8s RSTb timer */
#define FS26_FS_DIS8S_MASK               0x0010U
#define FS26_FS_DIS8S_SHIFT              0x0004U
/* Disable CLK Monitoring */
#define FS26_FS_CLK_MON_DIS_MASK         0x0020U
#define FS26_FS_CLK_MON_DIS_SHIFT        0x0005U
/* Assert RSTb in case a short to high is detected on FS1b */
#define FS26_FS_BACKUP_SAFETY_PATH_FS1B_MASK  0x0040U
#define FS26_FS_BACKUP_SAFETY_PATH_FS1B_SHIFT 0x0006U
/* Assert RSTB in case a short to high is detected on FS0b */
#define FS26_FS_BACKUP_SAFETY_PATH_FS0B_MASK  0x0080U
#define FS26_FS_BACKUP_SAFETY_PATH_FS0B_SHIFT 0x0007U
/* Reset duration configuration */
#define FS26_FS_RSTB_DUR_MASK            0x0200U
#define FS26_FS_RSTB_DUR_SHIFT           0x0009U
/* Configure the RSTB and FS0b behavior when fault error counter is higher than/equals intermediate value */
#define FS26_FS_FLT_ERR_REACTION_MASK    0x1800U
#define FS26_FS_FLT_ERR_REACTION_SHIFT   0x000BU
/* Configure the maximum level of the fault counter */
#define FS26_FS_FLT_ERR_CNT_LIMIT_MASK   0xC000U
#define FS26_FS_FLT_ERR_CNT_LIMIT_SHIFT  0x000EU

/* 0 */
#define FS26_FS_FLT_ERR_CNT_0            (0x0000U << FS26_FS_FLT_ERR_CNT_SHIFT)
/* 1 */
#define FS26_FS_FLT_ERR_CNT_1            (0x0001U << FS26_FS_FLT_ERR_CNT_SHIFT)
/* 2 */
#define FS26_FS_FLT_ERR_CNT_2            (0x0002U << FS26_FS_FLT_ERR_CNT_SHIFT)
/* 3 */
#define FS26_FS_FLT_ERR_CNT_3            (0x0003U << FS26_FS_FLT_ERR_CNT_SHIFT)
/* 4 */
#define FS26_FS_FLT_ERR_CNT_4            (0x0004U << FS26_FS_FLT_ERR_CNT_SHIFT)
/* 5 */
#define FS26_FS_FLT_ERR_CNT_5            (0x0005U << FS26_FS_FLT_ERR_CNT_SHIFT)
/* 6 */
#define FS26_FS_FLT_ERR_CNT_6            (0x0006U << FS26_FS_FLT_ERR_CNT_SHIFT)
/* 7 */
#define FS26_FS_FLT_ERR_CNT_7            (0x0007U << FS26_FS_FLT_ERR_CNT_SHIFT)
/* 8 */
#define FS26_FS_FLT_ERR_CNT_8            (0x0008U << FS26_FS_FLT_ERR_CNT_SHIFT)
/* 9 */
#define FS26_FS_FLT_ERR_CNT_9            (0x0009U << FS26_FS_FLT_ERR_CNT_SHIFT)
/* 10 */
#define FS26_FS_FLT_ERR_CNT_10           (0x000AU << FS26_FS_FLT_ERR_CNT_SHIFT)
/* 11 */
#define FS26_FS_FLT_ERR_CNT_11           (0x000BU << FS26_FS_FLT_ERR_CNT_SHIFT)
/* 12 */
#define FS26_FS_FLT_ERR_CNT_12           (0x000CU << FS26_FS_FLT_ERR_CNT_SHIFT)

/* RSTb LOW 8s Counter enabled */
#define FS26_FS_DIS8S_ENABLED            (0x0000U << FS26_FS_DIS8S_SHIFT)
/* RSTb LOW 8s Counter disabled */
#define FS26_FS_DIS8S_DISABLED           (0x0001U << FS26_FS_DIS8S_SHIFT)

/* CLK Monitoring active */
#define FS26_FS_CLK_MON_DIS_ACTIVE       (0x0000U << FS26_FS_CLK_MON_DIS_SHIFT)
/* CLK Monitoring disabled */
#define FS26_FS_CLK_MON_DIS_DISABLED     (0x0001U << FS26_FS_CLK_MON_DIS_SHIFT)

/* No assertion of the RSTb */
#define FS26_FS_BACKUP_SAFETY_PATH_FS1B_NO   (0x0000U << FS26_FS_BACKUP_SAFETY_PATH_FS1B_SHIFT)
/* RSTb assertion */
#define FS26_FS_BACKUP_SAFETY_PATH_FS1B_RSTB (0x0001U << FS26_FS_BACKUP_SAFETY_PATH_FS1B_SHIFT)

/* No assertion of the RSTb */
#define FS26_FS_BACKUP_SAFETY_PATH_FS0B_NO   (0x0000U << FS26_FS_BACKUP_SAFETY_PATH_FS0B_SHIFT)
/* RSTb assertion */
#define FS26_FS_BACKUP_SAFETY_PATH_FS0B_RSTB (0x0001U << FS26_FS_BACKUP_SAFETY_PATH_FS0B_SHIFT)

/* 10 ms */
#define FS26_FS_RSTB_DUR_10MS            (0x0000U << FS26_FS_RSTB_DUR_SHIFT)
/* 1 ms */
#define FS26_FS_RSTB_DUR_1MS             (0x0001U << FS26_FS_RSTB_DUR_SHIFT)

/* No effect on RSTb and FS0b */
#define FS26_FS_FLT_ERR_REACTION_NO_EFFECT (0x0000U << FS26_FS_FLT_ERR_REACTION_SHIFT)
/* FS0b is asserted low if FLTERRCNT is higher than/equals intermediate value */
#define FS26_FS_FLT_ERR_REACTION_FS0B      (0x0001U << FS26_FS_FLT_ERR_REACTION_SHIFT)
/* RSTb and FS0b are asserted low if FLTERRCNT is higher than/equals intermediate value */
#define FS26_FS_FLT_ERR_REACTION_RSTB_FS0B (0x0002U << FS26_FS_FLT_ERR_REACTION_SHIFT)

/* Max Value = 2 */
#define FS26_FS_FLT_ERR_CNT_LIMIT_2      (0x0000U << FS26_FS_FLT_ERR_CNT_LIMIT_SHIFT)
/* Max Value = 6 */
#define FS26_FS_FLT_ERR_CNT_LIMIT_6      (0x0001U << FS26_FS_FLT_ERR_CNT_LIMIT_SHIFT)
/* Max Value = 8 */
#define FS26_FS_FLT_ERR_CNT_LIMIT_8      (0x0002U << FS26_FS_FLT_ERR_CNT_LIMIT_SHIFT)
/* Max Value = 12 */
#define FS26_FS_FLT_ERR_CNT_LIMIT_12     (0x0003U << FS26_FS_FLT_ERR_CNT_LIMIT_SHIFT)

/******************************************************************************/
/* FS_WDW_DURATION - Type: RW                                                 */
/******************************************************************************/
#define FS26_FS_WDW_DURATION_ADDR        0x0BU
#define FS26_FS_WDW_DURATION_DEFAULT     0x0000U

/* Watchdog window period configuration */
#define FS26_FS_WDW_RECOVERY_MASK        0x000FU
#define FS26_FS_WDW_RECOVERY_SHIFT       0x0000U
/* Watchdog window Duty cycle */
#define FS26_FS_WDW_DC_MASK              0x01C0U
#define FS26_FS_WDW_DC_SHIFT             0x0006U
/* Watchdog window period configuration */
#define FS26_FS_WDW_PERIOD_MASK          0xF000U
#define FS26_FS_WDW_PERIOD_SHIFT         0x000CU

/* Disabled (infinite open window) */
#define FS26_FS_WDW_RECOVERY_INFINITE    (0x0000U << FS26_FS_WDW_RECOVERY_SHIFT)
/* 1 ms */
#define FS26_FS_WDW_RECOVERY_1MS         (0x0001U << FS26_FS_WDW_RECOVERY_SHIFT)
/* 2 ms */
#define FS26_FS_WDW_RECOVERY_2MS         (0x0002U << FS26_FS_WDW_RECOVERY_SHIFT)
/* 3 ms */
#define FS26_FS_WDW_RECOVERY_3MS         (0x0003U << FS26_FS_WDW_RECOVERY_SHIFT)
/* 4 ms */
#define FS26_FS_WDW_RECOVERY_4MS         (0x0004U << FS26_FS_WDW_RECOVERY_SHIFT)
/* 6 ms */
#define FS26_FS_WDW_RECOVERY_6MS         (0x0005U << FS26_FS_WDW_RECOVERY_SHIFT)
/* 8 ms */
#define FS26_FS_WDW_RECOVERY_8MS         (0x0006U << FS26_FS_WDW_RECOVERY_SHIFT)
/* 12 ms */
#define FS26_FS_WDW_RECOVERY_12MS        (0x0007U << FS26_FS_WDW_RECOVERY_SHIFT)
/* 16 ms */
#define FS26_FS_WDW_RECOVERY_16MS        (0x0008U << FS26_FS_WDW_RECOVERY_SHIFT)
/* 24 ms */
#define FS26_FS_WDW_RECOVERY_24MS        (0x0009U << FS26_FS_WDW_RECOVERY_SHIFT)
/* 32 ms */
#define FS26_FS_WDW_RECOVERY_32MS        (0x000AU << FS26_FS_WDW_RECOVERY_SHIFT)
/* 64 ms */
#define FS26_FS_WDW_RECOVERY_64MS        (0x000BU << FS26_FS_WDW_RECOVERY_SHIFT)
/* 128 ms */
#define FS26_FS_WDW_RECOVERY_128MS       (0x000CU << FS26_FS_WDW_RECOVERY_SHIFT)
/* 256 ms */
#define FS26_FS_WDW_RECOVERY_256MS       (0x000DU << FS26_FS_WDW_RECOVERY_SHIFT)
/* 512 ms */
#define FS26_FS_WDW_RECOVERY_512MS       (0x000EU << FS26_FS_WDW_RECOVERY_SHIFT)
/* 1024 ms */
#define FS26_FS_WDW_RECOVERY_1024MS      (0x000FU << FS26_FS_WDW_RECOVERY_SHIFT)

/* Closed Window : 31.25% / Open Window : 68.75% */
#define FS26_FS_WDW_DC_31C_68O           (0x0000U << FS26_FS_WDW_DC_SHIFT)
/* Closed Window : 37.50% / Open Window : 62.50% */
#define FS26_FS_WDW_DC_37C_62O            (0x0001U << FS26_FS_WDW_DC_SHIFT)
/* Closed Window : 50% / Open Window : 50% */
#define FS26_FS_WDW_DC_50C_50O           (0x0002U << FS26_FS_WDW_DC_SHIFT)
/* Closed Window : 62.50% / Open Window : 37.50% */
#define FS26_FS_WDW_DC_62C_37O            (0x0003U << FS26_FS_WDW_DC_SHIFT)
/* Closed Window : 68.75% / Open Window : 31.25% */
#define FS26_FS_WDW_DC_68C_31O           (0x0004U << FS26_FS_WDW_DC_SHIFT)

/* Disabled (infinite open window) */
#define FS26_FS_WDW_PERIOD_INFINITE      (0x0000U << FS26_FS_WDW_PERIOD_SHIFT)
/* 1 ms */
#define FS26_FS_WDW_PERIOD_1MS           (0x0001U << FS26_FS_WDW_PERIOD_SHIFT)
/* 2 ms */
#define FS26_FS_WDW_PERIOD_2MS           (0x0002U << FS26_FS_WDW_PERIOD_SHIFT)
/* 3 ms */
#define FS26_FS_WDW_PERIOD_3MS           (0x0003U << FS26_FS_WDW_PERIOD_SHIFT)
/* 4 ms */
#define FS26_FS_WDW_PERIOD_4MS           (0x0004U << FS26_FS_WDW_PERIOD_SHIFT)
/* 6 ms */
#define FS26_FS_WDW_PERIOD_6MS           (0x0005U << FS26_FS_WDW_PERIOD_SHIFT)
/* 8 ms */
#define FS26_FS_WDW_PERIOD_8MS           (0x0006U << FS26_FS_WDW_PERIOD_SHIFT)
/* 12 ms */
#define FS26_FS_WDW_PERIOD_12MS          (0x0007U << FS26_FS_WDW_PERIOD_SHIFT)
/* 16 ms */
#define FS26_FS_WDW_PERIOD_16MS          (0x0008U << FS26_FS_WDW_PERIOD_SHIFT)
/* 24 ms */
#define FS26_FS_WDW_PERIOD_24MS          (0x0009U << FS26_FS_WDW_PERIOD_SHIFT)
/* 32 ms */
#define FS26_FS_WDW_PERIOD_32MS          (0x000AU << FS26_FS_WDW_PERIOD_SHIFT)
/* 64 ms */
#define FS26_FS_WDW_PERIOD_64MS          (0x000BU << FS26_FS_WDW_PERIOD_SHIFT)
/* 128 ms */
#define FS26_FS_WDW_PERIOD_128MS         (0x000CU << FS26_FS_WDW_PERIOD_SHIFT)
/* 256 ms */
#define FS26_FS_WDW_PERIOD_256MS         (0x000DU << FS26_FS_WDW_PERIOD_SHIFT)
/* 512 ms */
#define FS26_FS_WDW_PERIOD_512MS         (0x000EU << FS26_FS_WDW_PERIOD_SHIFT)
/* 1024 ms */
#define FS26_FS_WDW_PERIOD_1024MS        (0x000FU << FS26_FS_WDW_PERIOD_SHIFT)

/******************************************************************************/
/* FS_WD_ANSWER - Type: RW                                                    */
/******************************************************************************/
#define FS26_FS_WD_ANSWER_ADDR           0x0DU
#define FS26_FS_WD_ANSWER_DEFAULT        0x0000U

/* Watchdog answer from MCU. 16 bits watchdog answer needs to be written here. */
#define FS26_FS_WD_ANSWER_MASK           0xFFFFU
#define FS26_FS_WD_ANSWER_SHIFT          0x0000U

/******************************************************************************/
/* FS_WD_TOKEN - Type: RW                                                     */
/******************************************************************************/
#define FS26_FS_WD_TOKEN_ADDR            0x0EU
#define FS26_FS_WD_TOKEN_DEFAULT         0x5AB2U

/* WD Token code. Token value can be written by the MCU here. Default value is 0x5AB2. */
#define FS26_FS_WD_TOKEN_MASK            0xFFFFU
#define FS26_FS_WD_TOKEN_SHIFT           0x0000U

/******************************************************************************/
/* FS_ABIST_ON_DEMAND - Type: RW                                              */
/******************************************************************************/
#define FS26_FS_ABIST_ON_DEMAND_ADDR     0x0FU
#define FS26_FS_ABIST_ON_DEMAND_DEFAULT  0x0000U

/* Request ABIST on VMON_PRE */
#define FS26_FS_ABIST2_VPRE_MASK         0x0001U
#define FS26_FS_ABIST2_VPRE_SHIFT        0x0000U
/* Request ABIST on VMON_CORE */
#define FS26_FS_ABIST2_CORE_MASK         0x0002U
#define FS26_FS_ABIST2_CORE_SHIFT        0x0001U
/* Request ABIST on VMON_LDO1 */
#define FS26_FS_ABIST2_LDO1_MASK         0x0004U
#define FS26_FS_ABIST2_LDO1_SHIFT        0x0002U
/* Request ABIST on VMON_LDO2 */
#define FS26_FS_ABIST2_LDO2_MASK         0x0008U
#define FS26_FS_ABIST2_LDO2_SHIFT        0x0003U
/* Request ABIST on VMON_TRK1 */
#define FS26_FS_ABIST2_TRK1_MASK         0x0010U
#define FS26_FS_ABIST2_TRK1_SHIFT        0x0004U
/* Request ABIST on VMON_TRK2 */
#define FS26_FS_ABIST2_TRK2_MASK         0x0020U
#define FS26_FS_ABIST2_TRK2_SHIFT        0x0005U
/* Request ABIST on VMON_REF */
#define FS26_FS_ABIST2_REF_MASK          0x0040U
#define FS26_FS_ABIST2_REF_SHIFT         0x0006U
/* Request ABIST on VMON_EXT */
#define FS26_FS_ABIST2_EXT_MASK          0x0080U
#define FS26_FS_ABIST2_EXT_SHIFT         0x0007U
/* Launch ABIST on selected VMONs */
#define FS26_FS_LAUNCH_ABIST2_MASK       0x8000U
#define FS26_FS_LAUNCH_ABIST2_SHIFT      0x000FU

/* No ABIST */
#define FS26_FS_ABIST2_VPRE_NO_ABIST     (0x0000U << FS26_FS_ABIST2_VPRE_SHIFT)
/* ABIST on VMON_PRE Requested */
#define FS26_FS_ABIST2_VPRE_ABIST        (0x0001U << FS26_FS_ABIST2_VPRE_SHIFT)

/* No ABIST */
#define FS26_FS_ABIST2_CORE_NO_ABIST     (0x0000U << FS26_FS_ABIST2_CORE_SHIFT)
/* ABIST on VMON_CORE Requested */
#define FS26_FS_ABIST2_CORE_ABIST        (0x0001U << FS26_FS_ABIST2_CORE_SHIFT)

/* No ABIST */
#define FS26_FS_ABIST2_LDO1_NO_ABIST     (0x0000U << FS26_FS_ABIST2_LDO1_SHIFT)
/* ABIST on VMON_LDO1 Requested */
#define FS26_FS_ABIST2_LDO1_ABIST        (0x0001U << FS26_FS_ABIST2_LDO1_SHIFT)

/* No ABIST */
#define FS26_FS_ABIST2_LDO2_NO_ABIST     (0x0000U << FS26_FS_ABIST2_LDO2_SHIFT)
/* ABIST on VMON_LDO2 Requested */
#define FS26_FS_ABIST2_LDO2_ABIST        (0x0001U << FS26_FS_ABIST2_LDO2_SHIFT)

/* No ABIST */
#define FS26_FS_ABIST2_TRK1_NO_ABIST     (0x0000U << FS26_FS_ABIST2_TRK1_SHIFT)
/* ABIST on VMON_TRK1 Requested */
#define FS26_FS_ABIST2_TRK1_ABIST        (0x0001U << FS26_FS_ABIST2_TRK1_SHIFT)

/* No ABIST */
#define FS26_FS_ABIST2_TRK2_NO_ABIST     (0x0000U << FS26_FS_ABIST2_TRK2_SHIFT)
/* ABIST on VMON_TRK2 Requested */
#define FS26_FS_ABIST2_TRK2_ABIST        (0x0001U << FS26_FS_ABIST2_TRK2_SHIFT)

/* No ABIST */
#define FS26_FS_ABIST2_REF_NO_ABIST      (0x0000U << FS26_FS_ABIST2_REF_SHIFT)
/* ABIST on VMON_REF Requested */
#define FS26_FS_ABIST2_REF_ABIST         (0x0001U << FS26_FS_ABIST2_REF_SHIFT)

/* No ABIST */
#define FS26_FS_ABIST2_EXT_NO_ABIST      (0x0000U << FS26_FS_ABIST2_EXT_SHIFT)
/* ABIST on VMON_EXT Requested */
#define FS26_FS_ABIST2_EXT_ABIST         (0x0001U << FS26_FS_ABIST2_EXT_SHIFT)

/* No action */
#define FS26_FS_LAUNCH_ABIST2_NO_ABIST   (0x0000U << FS26_FS_LAUNCH_ABIST2_SHIFT)
/* ABIST launched */
#define FS26_FS_LAUNCH_ABIST2_ABIST      (0x0001U << FS26_FS_LAUNCH_ABIST2_SHIFT)

/******************************************************************************/
/* FS_OVUV_REG_STATUS - Type: RW                                              */
/******************************************************************************/
#define FS26_FS_OVUV_REG_STATUS_ADDR     0x10U
#define FS26_FS_OVUV_REG_STATUS_DEFAULT  0x0000U

/* Undervoltage Monitoring on VMON_EXT */
#define FS26_FS_EXT_UV_MASK              0x0001U
#define FS26_FS_EXT_UV_SHIFT             0x0000U
/* Overvoltage Monitoring on VMON_EXT */
#define FS26_FS_EXT_OV_MASK              0x0002U
#define FS26_FS_EXT_OV_SHIFT             0x0001U
/* Undervoltage Monitoring on VMON_REF */
#define FS26_FS_REF_UV_MASK              0x0004U
#define FS26_FS_REF_UV_SHIFT             0x0002U
/* Overvoltage Monitoring on VMON_REF */
#define FS26_FS_REF_OV_MASK              0x0008U
#define FS26_FS_REF_OV_SHIFT             0x0003U
/* Undervoltage Monitoring on TRK2 */
#define FS26_FS_TRK2_UV_MASK             0x0010U
#define FS26_FS_TRK2_UV_SHIFT            0x0004U
/* Overvoltage Monitoring on TRK2 */
#define FS26_FS_TRK2_OV_MASK             0x0020U
#define FS26_FS_TRK2_OV_SHIFT            0x0005U
/* Undervoltage Monitoring on TRK1 */
#define FS26_FS_TRK1_UV_MASK             0x0040U
#define FS26_FS_TRK1_UV_SHIFT            0x0006U
/* Overvoltage Monitoring on TRK1 */
#define FS26_FS_TRK1_OV_MASK             0x0080U
#define FS26_FS_TRK1_OV_SHIFT            0x0007U
/* Undervoltage Monitoring on LDO2 */
#define FS26_FS_LDO2_UV_MASK             0x0100U
#define FS26_FS_LDO2_UV_SHIFT            0x0008U
/* Overvoltage Monitoring on LDO2 */
#define FS26_FS_LDO2_OV_MASK             0x0200U
#define FS26_FS_LDO2_OV_SHIFT            0x0009U
/* Undervoltage Monitoring on LDO1 */
#define FS26_FS_LDO1_UV_MASK             0x0400U
#define FS26_FS_LDO1_UV_SHIFT            0x000AU
/* Overvoltage Monitoring on LDO1 */
#define FS26_FS_LDO1_OV_MASK             0x0800U
#define FS26_FS_LDO1_OV_SHIFT            0x000BU
/* Undervoltage Monitoring on VCORE */
#define FS26_FS_CORE_UV_MASK             0x1000U
#define FS26_FS_CORE_UV_SHIFT            0x000CU
/* Overvoltage Monitoring on VCORE */
#define FS26_FS_CORE_OV_MASK             0x2000U
#define FS26_FS_CORE_OV_SHIFT            0x000DU
/* Undervoltage Monitoring on VPRE */
#define FS26_FS_VPRE_UV_MASK             0x4000U
#define FS26_FS_VPRE_UV_SHIFT            0x000EU
/* Overvoltage Monitoring on VPRE */
#define FS26_FS_VPRE_OV_MASK             0x8000U
#define FS26_FS_VPRE_OV_SHIFT            0x000FU

/* No Undervoltage */
#define FS26_FS_EXT_UV_NO_EVENT          (0x0000U << FS26_FS_EXT_UV_SHIFT)
/* Undervoltage Reported on VMON_EXT */
#define FS26_FS_EXT_UV_EVENT             (0x0001U << FS26_FS_EXT_UV_SHIFT)

/* No Overvoltage */
#define FS26_FS_EXT_OV_NO_EVENT          (0x0000U << FS26_FS_EXT_OV_SHIFT)
/* Overvoltage Reported on VMON_EXT */
#define FS26_FS_EXT_OV_EVENT             (0x0001U << FS26_FS_EXT_OV_SHIFT)

/* No Undervoltage */
#define FS26_FS_REF_UV_NO_EVENT          (0x0000U << FS26_FS_REF_UV_SHIFT)
/* Undervoltage Reported on VMON_REF */
#define FS26_FS_REF_UV_EVENT             (0x0001U << FS26_FS_REF_UV_SHIFT)

/* No Overvoltage */
#define FS26_FS_REF_OV_NO_EVENT          (0x0000U << FS26_FS_REF_OV_SHIFT)
/* Overvoltage Reported on VMON_REF */
#define FS26_FS_REF_OV_EVENT             (0x0001U << FS26_FS_REF_OV_SHIFT)

/* No Undervoltage */
#define FS26_FS_TRK2_UV_NO_EVENT         (0x0000U << FS26_FS_TRK2_UV_SHIFT)
/* Undervoltage Reported on TRK2 */
#define FS26_FS_TRK2_UV_EVENT            (0x0001U << FS26_FS_TRK2_UV_SHIFT)

/* No Overvoltage */
#define FS26_FS_TRK2_OV_NO_EVENT         (0x0000U << FS26_FS_TRK2_OV_SHIFT)
/* Overvoltage Reported on TRK2 */
#define FS26_FS_TRK2_OV_EVENT            (0x0001U << FS26_FS_TRK2_OV_SHIFT)

/* No Undervoltage */
#define FS26_FS_TRK1_UV_NO_EVENT         (0x0000U << FS26_FS_TRK1_UV_SHIFT)
/* Undervoltage Reported on TRK1 */
#define FS26_FS_TRK1_UV_EVENT            (0x0001U << FS26_FS_TRK1_UV_SHIFT)

/* No Overvoltage */
#define FS26_FS_TRK1_OV_NO_EVENT         (0x0000U << FS26_FS_TRK1_OV_SHIFT)
/* Overvoltage Reported on TRK1 */
#define FS26_FS_TRK1_OV_EVENT            (0x0001U << FS26_FS_TRK1_OV_SHIFT)

/* No Undervoltage */
#define FS26_FS_LDO2_UV_NO_EVENT         (0x0000U << FS26_FS_LDO2_UV_SHIFT)
/* Undervoltage Reported on LDO2 */
#define FS26_FS_LDO2_UV_EVENT            (0x0001U << FS26_FS_LDO2_UV_SHIFT)

/* No Overvoltage */
#define FS26_FS_LDO2_OV_NO_EVENT         (0x0000U << FS26_FS_LDO2_OV_SHIFT)
/* Overvoltage Reported on LDO2 */
#define FS26_FS_LDO2_OV_EVENT            (0x0001U << FS26_FS_LDO2_OV_SHIFT)

/* No Undervoltage */
#define FS26_FS_LDO1_UV_NO_EVENT         (0x0000U << FS26_FS_LDO1_UV_SHIFT)
/* Undervoltage Reported on LDO1 */
#define FS26_FS_LDO1_UV_EVENT            (0x0001U << FS26_FS_LDO1_UV_SHIFT)

/* No Overvoltage */
#define FS26_FS_LDO1_OV_NO_EVENT         (0x0000U << FS26_FS_LDO1_OV_SHIFT)
/* Overvoltage Reported on LDO1 */
#define FS26_FS_LDO1_OV_EVENT            (0x0001U << FS26_FS_LDO1_OV_SHIFT)

/* No Undervoltage */
#define FS26_FS_CORE_UV_NO_EVENT         (0x0000U << FS26_FS_CORE_UV_SHIFT)
/* Undervoltage Reported on VCORE */
#define FS26_FS_CORE_UV_EVENT            (0x0001U << FS26_FS_CORE_UV_SHIFT)

/* No Overvoltage */
#define FS26_FS_CORE_OV_NO_EVENT         (0x0000U << FS26_FS_CORE_OV_SHIFT)
/* Overvoltage Reported on VCORE */
#define FS26_FS_CORE_OV_EVENT            (0x0001U << FS26_FS_CORE_OV_SHIFT)

/* No Undervoltage */
#define FS26_FS_VPRE_UV_NO_EVENT         (0x0000U << FS26_FS_VPRE_UV_SHIFT)
/* Undervoltage Reported on VPRE */
#define FS26_FS_VPRE_UV_EVENT            (0x0001U << FS26_FS_VPRE_UV_SHIFT)

/* No Overvoltage */
#define FS26_FS_VPRE_OV_NO_EVENT         (0x0000U << FS26_FS_VPRE_OV_SHIFT)
/* Overvoltage Reported on VPRE */
#define FS26_FS_VPRE_OV_EVENT            (0x0001U << FS26_FS_VPRE_OV_SHIFT)

/******************************************************************************/
/* FS_RELEASE_FS0B_FS1B - Type: RW                                            */
/******************************************************************************/
#define FS26_FS_RELEASE_FS0B_FS1B_ADDR    0x11U
#define FS26_FS_RELEASE_FS0B_FS1B_DEFAULT 0x0000U

