nxp-appcodehub/dm-power-delivery-frdm-a-s32k344/src/drivers/inc/fs26_map.h
/* Secure 16 bits word to release FS0b and/or FS1b. FS outputs code part. */
#define FS26_FS_RELEASE_FS_OUTPUT_MASK   0xE000U
#define FS26_FS_RELEASE_FS_OUTPUT_SHIFT  0x000DU
/* Secure 16 bits word to release FS0b and/or FS1b. WD token part. */
#define FS26_FS_RELEASE_WD_TOKEN_MASK    0x1FFFU
#define FS26_FS_RELEASE_WD_TOKEN_SHIFT   0x0000U

/* Release FS0b only */
#define FS26_FS_RELEASE_OUTPUT_FS0B      (0x0003U << FS26_FS_RELEASE_FS_OUTPUT_SHIFT)
/* Release FS0b and FS1b */
#define FS26_FS_RELEASE_OUTPUT_FS0B_FS1B (0x0005U << FS26_FS_RELEASE_FS_OUTPUT_SHIFT)
/* Release FS1b only */
#define FS26_FS_RELEASE_OUTPUT_FS1B      (0x0006U << FS26_FS_RELEASE_FS_OUTPUT_SHIFT)

/******************************************************************************/
/* FS_SAFE_IOS_1 - Type: RW                                                   */
/******************************************************************************/
#define FS26_FS_SAFE_IOS_1_ADDR          0x12U
#define FS26_FS_SAFE_IOS_1_DEFAULT       0x0000U

/* Go Back to INIT Fail Safe Request */
#define FS26_FS_GOTO_INIT_MASK           0x0002U
#define FS26_FS_GOTO_INIT_SHIFT          0x0001U
/* Request an assertion of FS1b */
#define FS26_FS_FS1B_REQ_MASK            0x0004U
#define FS26_FS_FS1B_REQ_SHIFT           0x0002U
/* Report a FS1b short to HIGH */
#define FS26_FS_FS1B_DIAG_MASK           0x0008U
#define FS26_FS_FS1B_DIAG_SHIFT          0x0003U
/* Sense of FS1b pad */
#define FS26_FS_FS1B_SNS_MASK            0x0010U
#define FS26_FS_FS1B_SNS_SHIFT           0x0004U
/* FS1b Driver - Digital Command */
#define FS26_FS_FS1B_DRV_MASK            0x0020U
#define FS26_FS_FS1B_DRV_SHIFT           0x0005U
/* Request an assertion of FS0b */
#define FS26_FS_FS0B_REQ_MASK            0x0040U
#define FS26_FS_FS0B_REQ_SHIFT           0x0006U
/* Report a FS0b short to HIGH */
#define FS26_FS_FS0B_DIAG_MASK           0x0080U
#define FS26_FS_FS0B_DIAG_SHIFT          0x0007U
/* Sense of FS0b pad */
#define FS26_FS_FS0B_SNS_MASK            0x0100U
#define FS26_FS_FS0B_SNS_SHIFT           0x0008U
/* FS0b Driver - Digital Command */
#define FS26_FS_FS0B_DRV_MASK            0x0200U
#define FS26_FS_FS0B_DRV_SHIFT           0x0009U
/* Request an assertion of Reset */
#define FS26_FS_RSTB_REQ_MASK            0x0400U
#define FS26_FS_RSTB_REQ_SHIFT           0x000AU
/* Report a Reset short to HIGH */
#define FS26_FS_RSTB_DIAG_MASK           0x0800U
#define FS26_FS_RSTB_DIAG_SHIFT          0x000BU
/* Report a Reset Event (latched) */
#define FS26_FS_RSTB_EVENT_MASK          0x1000U
#define FS26_FS_RSTB_EVENT_SHIFT         0x000CU
/* Sense of RSTb pad */
#define FS26_FS_RSTB_SNS_MASK            0x2000U
#define FS26_FS_RSTB_SNS_SHIFT           0x000DU
/* RSTb Driver - Digital Command */
#define FS26_FS_RSTB_DRV_MASK            0x4000U
#define FS26_FS_RSTB_DRV_SHIFT           0x000EU
/* Report an External Reset */
#define FS26_FS_EXT_RSTB_MASK            0x8000U
#define FS26_FS_EXT_RSTB_SHIFT           0x000FU

/* No action */
#define FS26_FS_GOTO_INIT_NO_ACTION      (0x0000U << FS26_FS_GOTO_INIT_SHIFT)
/* Go back to INIT FS */
#define FS26_FS_GOTO_INIT_INIT           (0x0001U << FS26_FS_GOTO_INIT_SHIFT)

/* No action */
#define FS26_FS_FS1B_REQ_NO_ACTION       (0x0000U << FS26_FS_FS1B_REQ_SHIFT)
/* FS1b assertion */
#define FS26_FS_FS1B_REQ_ASSERT          (0x0001U << FS26_FS_FS1B_REQ_SHIFT)

/* No Failure */
#define FS26_FS_FS1B_DIAG_NO_FAILURE     (0x0000U << FS26_FS_FS1B_DIAG_SHIFT)
/* Short to High detected */
#define FS26_FS_FS1B_DIAG_SHORT          (0x0001U << FS26_FS_FS1B_DIAG_SHIFT)

/* FS1b pad sensed low */
#define FS26_FS_FS1B_SNS_LOW             (0x0000U << FS26_FS_FS1B_SNS_SHIFT)
/* FS1b pad sensed High */
#define FS26_FS_FS1B_SNS_HIGH            (0x0001U << FS26_FS_FS1B_SNS_SHIFT)

/* FS1b Driver command sensed Low */
#define FS26_FS_FS1B_DRV_LOW             (0x0000U << FS26_FS_FS1B_DRV_SHIFT)
/* FS1b Driver command sensed High */
#define FS26_FS_FS1B_DRV_HIGH            (0x0001U << FS26_FS_FS1B_DRV_SHIFT)

/* No action */
#define FS26_FS_FS0B_REQ_NO_ACTION       (0x0000U << FS26_FS_FS0B_REQ_SHIFT)
/* FS0b assertion */
#define FS26_FS_FS0B_REQ_ASSERT          (0x0001U << FS26_FS_FS0B_REQ_SHIFT)

/* No Failure */
#define FS26_FS_FS0B_DIAG_NO_FAILURE     (0x0000U << FS26_FS_FS0B_DIAG_SHIFT)
/* Short to High detected */
#define FS26_FS_FS0B_DIAG_SHORT          (0x0001U << FS26_FS_FS0B_DIAG_SHIFT)

/* FS0b pad sensed low */
#define FS26_FS_FS0B_SNS_LOW             (0x0000U << FS26_FS_FS0B_SNS_SHIFT)
/* FS0b pad sensed High */
#define FS26_FS_FS0B_SNS_HIGH            (0x0001U << FS26_FS_FS0B_SNS_SHIFT)

/* FS0b Driver command sensed Low */
#define FS26_FS_FS0B_DRV_LOW             (0x0000U << FS26_FS_FS0B_DRV_SHIFT)
/* FS0b Driver command sensed High */
#define FS26_FS_FS0B_DRV_HIGH            (0x0001U << FS26_FS_FS0B_DRV_SHIFT)

/* No action */
#define FS26_FS_RSTB_REQ_NO_ACTION       (0x0000U << FS26_FS_RSTB_REQ_SHIFT)
/* RSTb assertion (pulse) */
#define FS26_FS_RSTB_REQ_ASSERT          (0x0001U << FS26_FS_RSTB_REQ_SHIFT)

/* No Failure */
#define FS26_FS_RSTB_DIAG_NO_FAILURE     (0x0000U << FS26_FS_RSTB_DIAG_SHIFT)
/* Short to High detected */
#define FS26_FS_RSTB_DIAG_SHORT          (0x0001U << FS26_FS_RSTB_DIAG_SHIFT)

/* No Failure */
#define FS26_FS_RSTB_EVENT_NO_RESET      (0x0000U << FS26_FS_RSTB_EVENT_SHIFT)
/* Reset Occurred */
#define FS26_FS_RSTB_EVENT_RESET         (0x0001U << FS26_FS_RSTB_EVENT_SHIFT)

/* RSTb pad sensed low */
#define FS26_FS_RSTB_SNS_LOW             (0x0000U << FS26_FS_RSTB_SNS_SHIFT)
/* RSTb pad sensed High */
#define FS26_FS_RSTB_SNS_HIGH            (0x0001U << FS26_FS_RSTB_SNS_SHIFT)

/* RSTb Driver command sensed Low */
#define FS26_FS_RSTB_DRV_LOW             (0x0000U << FS26_FS_RSTB_DRV_SHIFT)
/* RSTb Driver command sensed High */
#define FS26_FS_RSTB_DRV_HIGH            (0x0001U << FS26_FS_RSTB_DRV_SHIFT)

/* No External Reset */
#define FS26_FS_EXT_RSTB_NO_EVENT        (0x0000U << FS26_FS_EXT_RSTB_SHIFT)
/* External Reset */
#define FS26_FS_EXT_RSTB_EVENT           (0x0001U << FS26_FS_EXT_RSTB_SHIFT)

/******************************************************************************/
/* FS_SAFE_IOS_2 - Type: RW                                                   */
/******************************************************************************/
#define FS26_FS_SAFE_IOS_2_ADDR          0x13U
#define FS26_FS_SAFE_IOS_2_DEFAULT       0x0000U

/* FS1b duration timing when low */
#define FS26_FS_FS1B_TDUR_MASK           0x001FU
#define FS26_FS_FS1B_TDUR_SHIFT          0x0000U
/* FS1b delay after assertion of FS0b */
#define FS26_FS_FS1B_TDELAY_MASK         0x03E0U
#define FS26_FS_FS1B_TDELAY_SHIFT        0x0005U

/* 0 ms (no assertion of FS0b) */
#define FS26_FS_FS1B_TDUR_0MS            (0x0000U << FS26_FS_FS1B_TDUR_SHIFT)
/* 5 ms */
#define FS26_FS_FS1B_TDUR_5MS            (0x0001U << FS26_FS_FS1B_TDUR_SHIFT)
/* 10 ms */
#define FS26_FS_FS1B_TDUR_10MS           (0x0002U << FS26_FS_FS1B_TDUR_SHIFT)
/* 15 ms */
#define FS26_FS_FS1B_TDUR_15MS           (0x0003U << FS26_FS_FS1B_TDUR_SHIFT)
/* 20 ms */
#define FS26_FS_FS1B_TDUR_20MS           (0x0004U << FS26_FS_FS1B_TDUR_SHIFT)
/* 25 ms */
#define FS26_FS_FS1B_TDUR_25MS           (0x0005U << FS26_FS_FS1B_TDUR_SHIFT)
/* 30 ms */
#define FS26_FS_FS1B_TDUR_30MS           (0x0006U << FS26_FS_FS1B_TDUR_SHIFT)
/* 40 ms */
#define FS26_FS_FS1B_TDUR_40MS           (0x0007U << FS26_FS_FS1B_TDUR_SHIFT)
/* 50 ms */
#define FS26_FS_FS1B_TDUR_50MS           (0x0008U << FS26_FS_FS1B_TDUR_SHIFT)
/* 60 ms */
#define FS26_FS_FS1B_TDUR_60MS           (0x0009U << FS26_FS_FS1B_TDUR_SHIFT)
/* 80 ms */
#define FS26_FS_FS1B_TDUR_80MS           (0x000AU << FS26_FS_FS1B_TDUR_SHIFT)
/* 100 ms */
#define FS26_FS_FS1B_TDUR_100MS          (0x000BU << FS26_FS_FS1B_TDUR_SHIFT)
/* 125 ms */
#define FS26_FS_FS1B_TDUR_125MS          (0x000CU << FS26_FS_FS1B_TDUR_SHIFT)
/* 150 ms */
#define FS26_FS_FS1B_TDUR_150MS          (0x000DU << FS26_FS_FS1B_TDUR_SHIFT)
/* 175 ms */
#define FS26_FS_FS1B_TDUR_175MS          (0x000EU << FS26_FS_FS1B_TDUR_SHIFT)
/* 200 ms */
#define FS26_FS_FS1B_TDUR_200MS          (0x000FU << FS26_FS_FS1B_TDUR_SHIFT)
/* 225 ms */
#define FS26_FS_FS1B_TDUR_225MS          (0x0010U << FS26_FS_FS1B_TDUR_SHIFT)
/* 250 ms */
#define FS26_FS_FS1B_TDUR_250MS          (0x0011U << FS26_FS_FS1B_TDUR_SHIFT)
/* 300 ms */
#define FS26_FS_FS1B_TDUR_300MS          (0x0012U << FS26_FS_FS1B_TDUR_SHIFT)
/* 400 ms */
#define FS26_FS_FS1B_TDUR_400MS          (0x0013U << FS26_FS_FS1B_TDUR_SHIFT)
/* 500 ms */
#define FS26_FS_FS1B_TDUR_500MS          (0x0014U << FS26_FS_FS1B_TDUR_SHIFT)
/* 600 ms */
#define FS26_FS_FS1B_TDUR_600MS          (0x0015U << FS26_FS_FS1B_TDUR_SHIFT)
/* 700 ms */
#define FS26_FS_FS1B_TDUR_700MS          (0x0016U << FS26_FS_FS1B_TDUR_SHIFT)
/* 800 ms */
#define FS26_FS_FS1B_TDUR_800MS          (0x0017U << FS26_FS_FS1B_TDUR_SHIFT)
/* 1 s */
#define FS26_FS_FS1B_TDUR_1S             (0x0018U << FS26_FS_FS1B_TDUR_SHIFT)
/* 2 s */
#define FS26_FS_FS1B_TDUR_2S             (0x0019U << FS26_FS_FS1B_TDUR_SHIFT)
/* 4 s */
#define FS26_FS_FS1B_TDUR_4S             (0x001AU << FS26_FS_FS1B_TDUR_SHIFT)
/* 5 s */
#define FS26_FS_FS1B_TDUR_5S             (0x001BU << FS26_FS_FS1B_TDUR_SHIFT)
/* 6 s */
#define FS26_FS_FS1B_TDUR_6S             (0x001CU << FS26_FS_FS1B_TDUR_SHIFT)
/* 8 s */
#define FS26_FS_FS1B_TDUR_8S             (0x001DU << FS26_FS_FS1B_TDUR_SHIFT)
/* 10 s */
#define FS26_FS_FS1B_TDUR_10S            (0x001EU << FS26_FS_FS1B_TDUR_SHIFT)
/* Infinite (FS1b released by MCU) */
#define FS26_FS_FS1B_TDUR_INFINITE       (0x001FU << FS26_FS_FS1B_TDUR_SHIFT)

/* 0 ms (start with FS0b - no delay) */
#define FS26_FS_FS1B_TDELAY_0MS          (0x0000U << FS26_FS_FS1B_TDELAY_SHIFT)
/* 5 ms */
#define FS26_FS_FS1B_TDELAY_5MS          (0x0001U << FS26_FS_FS1B_TDELAY_SHIFT)
/* 10 ms */
#define FS26_FS_FS1B_TDELAY_10MS         (0x0002U << FS26_FS_FS1B_TDELAY_SHIFT)
/* 15 ms */
#define FS26_FS_FS1B_TDELAY_15MS         (0x0003U << FS26_FS_FS1B_TDELAY_SHIFT)
/* 20 ms */
#define FS26_FS_FS1B_TDELAY_20MS         (0x0004U << FS26_FS_FS1B_TDELAY_SHIFT)
/* 25 ms */
#define FS26_FS_FS1B_TDELAY_25MS         (0x0005U << FS26_FS_FS1B_TDELAY_SHIFT)
/* 30 ms */
#define FS26_FS_FS1B_TDELAY_30MS         (0x0006U << FS26_FS_FS1B_TDELAY_SHIFT)
/* 40 ms */
#define FS26_FS_FS1B_TDELAY_40MS         (0x0007U << FS26_FS_FS1B_TDELAY_SHIFT)
/* 50 ms */
#define FS26_FS_FS1B_TDELAY_50MS         (0x0008U << FS26_FS_FS1B_TDELAY_SHIFT)
/* 60 ms */
#define FS26_FS_FS1B_TDELAY_60MS         (0x0009U << FS26_FS_FS1B_TDELAY_SHIFT)
/* 80 ms */
#define FS26_FS_FS1B_TDELAY_80MS         (0x000AU << FS26_FS_FS1B_TDELAY_SHIFT)
/* 100 ms */
#define FS26_FS_FS1B_TDELAY_100MS        (0x000BU << FS26_FS_FS1B_TDELAY_SHIFT)
/* 125 ms */
#define FS26_FS_FS1B_TDELAY_125MS        (0x000CU << FS26_FS_FS1B_TDELAY_SHIFT)
/* 150 ms */
#define FS26_FS_FS1B_TDELAY_150MS        (0x000DU << FS26_FS_FS1B_TDELAY_SHIFT)
/* 175 ms */
#define FS26_FS_FS1B_TDELAY_175MS        (0x000EU << FS26_FS_FS1B_TDELAY_SHIFT)
/* 200 ms */
#define FS26_FS_FS1B_TDELAY_200MS        (0x000FU << FS26_FS_FS1B_TDELAY_SHIFT)
/* 225 ms */
#define FS26_FS_FS1B_TDELAY_225MS        (0x0010U << FS26_FS_FS1B_TDELAY_SHIFT)
/* 250 ms */
#define FS26_FS_FS1B_TDELAY_250MS        (0x0011U << FS26_FS_FS1B_TDELAY_SHIFT)
/* 300 ms */
#define FS26_FS_FS1B_TDELAY_300MS        (0x0012U << FS26_FS_FS1B_TDELAY_SHIFT)
/* 400 ms */
#define FS26_FS_FS1B_TDELAY_400MS        (0x0013U << FS26_FS_FS1B_TDELAY_SHIFT)
/* 500 ms */
#define FS26_FS_FS1B_TDELAY_500MS        (0x0014U << FS26_FS_FS1B_TDELAY_SHIFT)
/* 600 ms */
#define FS26_FS_FS1B_TDELAY_600MS        (0x0015U << FS26_FS_FS1B_TDELAY_SHIFT)
/* 700 ms */
#define FS26_FS_FS1B_TDELAY_700MS        (0x0016U << FS26_FS_FS1B_TDELAY_SHIFT)
/* 800 ms */
#define FS26_FS_FS1B_TDELAY_800MS        (0x0017U << FS26_FS_FS1B_TDELAY_SHIFT)
/* 900 ms */
#define FS26_FS_FS1B_TDELAY_900MS        (0x0018U << FS26_FS_FS1B_TDELAY_SHIFT)
/* 1 s */
#define FS26_FS_FS1B_TDELAY_1S           (0x0019U << FS26_FS_FS1B_TDELAY_SHIFT)
/* 2 s */
#define FS26_FS_FS1B_TDELAY_2S           (0x001AU << FS26_FS_FS1B_TDELAY_SHIFT)
/* 4 s */
#define FS26_FS_FS1B_TDELAY_4S           (0x001BU << FS26_FS_FS1B_TDELAY_SHIFT)
/* 5 s */
#define FS26_FS_FS1B_TDELAY_5S           (0x001CU << FS26_FS_FS1B_TDELAY_SHIFT)
/* 6 s */
#define FS26_FS_FS1B_TDELAY_6S           (0x001DU << FS26_FS_FS1B_TDELAY_SHIFT)
/* 8 s */
#define FS26_FS_FS1B_TDELAY_8S           (0x001EU << FS26_FS_FS1B_TDELAY_SHIFT)
/* 10 s */
#define FS26_FS_FS1B_TDELAY_10S          (0x001FU << FS26_FS_FS1B_TDELAY_SHIFT)

/******************************************************************************/
/* FS_DIAG_SAFETY1 - Type: RW                                                 */
/******************************************************************************/
#define FS26_FS_DIAG_SAFETY1_ADDR        0x14U
#define FS26_FS_DIAG_SAFETY1_DEFAULT     0x0000U

/* LBIST Status (MSB = LBIST_CHK_PAT_OK, LSB = LBIST_CHECKER_OK) */
#define FS26_FS_LBIST_STATUS_MASK        0x0003U
#define FS26_FS_LBIST_STATUS_SHIFT       0x0000U
/* Drift of the Fail Safe Oscillator */
#define FS26_FS_FS_OSC_DRIFT_MASK        0x0004U
#define FS26_FS_FS_OSC_DRIFT_SHIFT       0x0002U
/* FS SPI communication error - CRC */
#define FS26_FS_SPI_FS_CRC_MASK          0x0008U
#define FS26_FS_SPI_FS_CRC_SHIFT         0x0003U
/* Invalid FS SPI access (wrong write or read, Write to INIT registers in normal mode, or Wrong address) */
#define FS26_FS_SPI_FS_REQ_MASK          0x0010U
#define FS26_FS_SPI_FS_REQ_SHIFT         0x0004U
/* FS SPI SCLK Error detection */
#define FS26_FS_SPI_FS_CLK_MASK          0x0020U
#define FS26_FS_SPI_FS_CLK_SHIFT         0x0005U
/* Diagnostic on ABIST on Demand */
#define FS26_FS_ABIST2_DONE_MASK         0x0040U
#define FS26_FS_ABIST2_DONE_SHIFT        0x0006U
/* Report ABIST 2 status */
#define FS26_FS_ABIST2_PASS_MASK         0x0080U
#define FS26_FS_ABIST2_PASS_SHIFT        0x0007U
/* Diagnostic on ABIST 1 */
#define FS26_FS_ABIST1_PASS_MASK         0x0100U
#define FS26_FS_ABIST1_PASS_SHIFT        0x0008U
/* WD Refresh status - Timing */
#define FS26_FS_BAD_WD_TIMING_MASK       0x0200U
#define FS26_FS_BAD_WD_TIMING_SHIFT      0x0009U
/* WD Refresh status - Data */
#define FS26_FS_BAD_WD_DATA_MASK         0x0400U
#define FS26_FS_BAD_WD_DATA_SHIFT        0x000AU

/* LBIST FAIL */
#define FS26_FS_LBIST_STATUS_FAIL        (0x0000U << FS26_FS_LBIST_STATUS_SHIFT)
/* LBIST BYPASSED */
#define FS26_FS_LBIST_STATUS_BYPASSED    (0x0001U << FS26_FS_LBIST_STATUS_SHIFT)
/* LBIST FAIL */
#define FS26_FS_LBIST_STATUS_FAIL_0      (0x0002U << FS26_FS_LBIST_STATUS_SHIFT)
/* LBIST OK */
#define FS26_FS_LBIST_STATUS_OK          (0x0003U << FS26_FS_LBIST_STATUS_SHIFT)

/* No Drift */
#define FS26_FS_FS_OSC_DRIFT_NO_DRIFT    (0x0000U << FS26_FS_FS_OSC_DRIFT_SHIFT)
/* Oscillator Drift */
#define FS26_FS_FS_OSC_DRIFT_DRIFT       (0x0001U << FS26_FS_FS_OSC_DRIFT_SHIFT)

/* No Error */
#define FS26_FS_SPI_FS_CRC_NO_ERROR      (0x0000U << FS26_FS_SPI_FS_CRC_SHIFT)
/* Error detected in the CRC */
#define FS26_FS_SPI_FS_CRC_ERROR         (0x0001U << FS26_FS_SPI_FS_CRC_SHIFT)

/* No Error */
#define FS26_FS_SPI_FS_REQ_NO_ERROR      (0x0000U << FS26_FS_SPI_FS_REQ_SHIFT)
/* SPI Violation */
#define FS26_FS_SPI_FS_REQ_ERROR         (0x0001U << FS26_FS_SPI_FS_REQ_SHIFT)

/* No Error */
#define FS26_FS_SPI_FS_CLK_NO_ERROR      (0x0000U << FS26_FS_SPI_FS_CLK_SHIFT)
/* Wrong number of CLK Cycles (other than 32) */
#define FS26_FS_SPI_FS_CLK_ERROR         (0x0001U << FS26_FS_SPI_FS_CLK_SHIFT)

/* ABIST on demand Fail or not executed */
#define FS26_FS_ABIST2_DONE_FAIL         (0x0000U << FS26_FS_ABIST2_DONE_SHIFT)
/* ABIST On Demand Pass */
#define FS26_FS_ABIST2_DONE_PASS         (0x0001U << FS26_FS_ABIST2_DONE_SHIFT)

/* ABIST2 not finished */
#define FS26_FS_ABIST2_PASS_NOT_FINISHED (0x0000U << FS26_FS_ABIST2_PASS_SHIFT)
/* ABIST2 PASS */
#define FS26_FS_ABIST2_PASS_PASS         (0x0001U << FS26_FS_ABIST2_PASS_SHIFT)

/* ABIST Fail or not executed */
#define FS26_FS_ABIST1_PASS_FAIL         (0x0000U << FS26_FS_ABIST1_PASS_SHIFT)
/* ABIST 1 Pass */
#define FS26_FS_ABIST1_PASS_PASS         (0x0001U << FS26_FS_ABIST1_PASS_SHIFT)

