nxp-appcodehub/dm-power-delivery-frdm-a-s32k344/src/drivers/inc/fs26_map.h
/* Good WD Refresh */
#define FS26_FS_BAD_WD_TIMING_GOOD       (0x0000U << FS26_FS_BAD_WD_TIMING_SHIFT)
/* Bad WD refresh, Error in the Timing (window) */
#define FS26_FS_BAD_WD_TIMING_BAD        (0x0001U << FS26_FS_BAD_WD_TIMING_SHIFT)

/* Good WD Refresh */
#define FS26_FS_BAD_WD_DATA_GOOD         (0x0000U << FS26_FS_BAD_WD_DATA_SHIFT)
/* Bad WD refresh, Error in the Data */
#define FS26_FS_BAD_WD_DATA_BAD          (0x0001U << FS26_FS_BAD_WD_DATA_SHIFT)

/******************************************************************************/
/* FS_DIAG_SAFETY2 - Type: RW                                                 */
/******************************************************************************/
#define FS26_FS_DIAG_SAFETY2_ADDR        0x15U
#define FS26_FS_DIAG_SAFETY2_DEFAULT     0x0000U

/* Report ERRMON pin status */
#define FS26_FS_ERRMON_PIN_STATUS_MASK   0x0001U
#define FS26_FS_ERRMON_PIN_STATUS_SHIFT  0x0000U
/* Report an error in the ERRMON input */
#define FS26_FS_ERRMON_MASK              0x0002U
#define FS26_FS_ERRMON_SHIFT             0x0001U
/* Acknowledge ERRMON Failure Timer */
#define FS26_FS_ERRMON_ACK_MASK          0x0004U
#define FS26_FS_ERRMON_ACK_SHIFT         0x0002U
/* Sense of FCCU2 */
#define FS26_FS_FCCU2_RT_MASK            0x0008U
#define FS26_FS_FCCU2_RT_SHIFT           0x0003U
/* Sense of FCCU1 */
#define FS26_FS_FCCU1_RT_MASK            0x0010U
#define FS26_FS_FCCU1_RT_SHIFT           0x0004U
/* Report an error in the FCCU2 input */
#define FS26_FS_FCCU2_MASK               0x0020U
#define FS26_FS_FCCU2_SHIFT              0x0005U
/* Report an error in the FCCU1 input */
#define FS26_FS_FCCU1_MASK               0x0040U
#define FS26_FS_FCCU1_SHIFT              0x0006U
/* Report an error in the FCCU12 input */
#define FS26_FS_FCCU12_MASK              0x0080U
#define FS26_FS_FCCU12_SHIFT             0x0007U

/* Low level */
#define FS26_FS_ERRMON_PIN_STATUS_LOW    (0x0000U << FS26_FS_ERRMON_PIN_STATUS_SHIFT)
/* High level */
#define FS26_FS_ERRMON_PIN_STATUS_HIGH   (0x0001U << FS26_FS_ERRMON_PIN_STATUS_SHIFT)

/* No error */
#define FS26_FS_ERRMON_NO_ERROR          (0x0000U << FS26_FS_ERRMON_SHIFT)
/* Error Detected */
#define FS26_FS_ERRMON_ERROR             (0x0001U << FS26_FS_ERRMON_SHIFT)

/* No error */
#define FS26_FS_ERRMON_ACK_NO_ERROR      (0x0000U << FS26_FS_ERRMON_ACK_SHIFT)
/* Acknowledge ERRMON timeout */
#define FS26_FS_ERRMON_ACK_TIMEOUT       (0x0001U << FS26_FS_ERRMON_ACK_SHIFT)

/* FCCU2 Low */
#define FS26_FS_FCCU2_RT_LOW             (0x0000U << FS26_FS_FCCU2_RT_SHIFT)
/* FCCU2 Low */
#define FS26_FS_FCCU2_RT_HIGH            (0x0001U << FS26_FS_FCCU2_RT_SHIFT)

/* FCCU1 Low */
#define FS26_FS_FCCU1_RT_LOW             (0x0000U << FS26_FS_FCCU1_RT_SHIFT)
/* FCCU1 Low */
#define FS26_FS_FCCU1_RT_HIGH            (0x0001U << FS26_FS_FCCU1_RT_SHIFT)

/* No error */
#define FS26_FS_FCCU2_NO_ERROR           (0x0000U << FS26_FS_FCCU2_SHIFT)
/* Error Detected */
#define FS26_FS_FCCU2_ERROR              (0x0001U << FS26_FS_FCCU2_SHIFT)

/* No error */
#define FS26_FS_FCCU1_NO_ERROR           (0x0000U << FS26_FS_FCCU1_SHIFT)
/* Error Detected */
#define FS26_FS_FCCU1_ERROR              (0x0001U << FS26_FS_FCCU1_SHIFT)

/* No error */
#define FS26_FS_FCCU12_NO_ERROR          (0x0000U << FS26_FS_FCCU12_SHIFT)
/* Error Detected */
#define FS26_FS_FCCU12_ERROR             (0x0001U << FS26_FS_FCCU12_SHIFT)

/******************************************************************************/
/* FS_INTB_MASK - Type: RW                                                    */
/******************************************************************************/
#define FS26_FS_INTB_MASK_ADDR           0x16U
#define FS26_FS_INTB_MASK_DEFAULT        0x0000U

/* Interruption Mask on ERRMON */
#define FS26_FS_ERRMON_M_MASK            0x0010U
#define FS26_FS_ERRMON_M_SHIFT           0x0004U
/* Interruption Mask on BAD_WD_REFRESH */
#define FS26_FS_BAD_WD_M_MASK            0x0020U
#define FS26_FS_BAD_WD_M_SHIFT           0x0005U
/* Interruption Mask on FCCU2 */
#define FS26_FS_FCCU2_M_MASK             0x0040U
#define FS26_FS_FCCU2_M_SHIFT            0x0006U
/* Interruption Mask on FCCU1 */
#define FS26_FS_FCCU1_M_MASK             0x0080U
#define FS26_FS_FCCU1_M_SHIFT            0x0007U
/* Interruption Mask on VMON_EXT event */
#define FS26_FS_EXT_M_MASK               0x0100U
#define FS26_FS_EXT_M_SHIFT              0x0008U
/* Interruption Mask on VMON_REF event */
#define FS26_FS_REF_M_MASK               0x0200U
#define FS26_FS_REF_M_SHIFT              0x0009U
/* Interruption Mask on VMON_TRK2 event */
#define FS26_FS_TRK2_M_MASK              0x0400U
#define FS26_FS_TRK2_M_SHIFT             0x000AU
/* Interruption Mask on VMON_TRK1 event */
#define FS26_FS_TRK1_M_MASK              0x0800U
#define FS26_FS_TRK1_M_SHIFT             0x000BU
/* Interruption Mask on VMON_LDO2 event */
#define FS26_FS_LDO2_M_MASK              0x1000U
#define FS26_FS_LDO2_M_SHIFT             0x000CU
/* Interruption Mask on VMON_LDO1 event */
#define FS26_FS_LDO1_M_MASK              0x2000U
#define FS26_FS_LDO1_M_SHIFT             0x000DU
/* Interruption Mask on VMON_CORE event */
#define FS26_FS_CORE_M_MASK              0x4000U
#define FS26_FS_CORE_M_SHIFT             0x000EU
/* Interruption Mask on VMON_PRE event */
#define FS26_FS_VPRE_M_MASK              0x8000U
#define FS26_FS_VPRE_M_SHIFT             0x000FU

/* Interruption Not Masked */
#define FS26_FS_ERRMON_M_NOT_MASKED      (0x0000U << FS26_FS_ERRMON_M_SHIFT)
/* Interruption Masked */
#define FS26_FS_ERRMON_M_MASKED          (0x0001U << FS26_FS_ERRMON_M_SHIFT)

/* Interruption Not Masked */
#define FS26_FS_BAD_WD_M_NOT_MASKED      (0x0000U << FS26_FS_BAD_WD_M_SHIFT)
/* Interruption Masked */
#define FS26_FS_BAD_WD_M_MASKED          (0x0001U << FS26_FS_BAD_WD_M_SHIFT)

/* Interruption Not Masked */
#define FS26_FS_FCCU2_M_NOT_MASKED       (0x0000U << FS26_FS_FCCU2_M_SHIFT)
/* Interruption Masked */
#define FS26_FS_FCCU2_M_MASKED           (0x0001U << FS26_FS_FCCU2_M_SHIFT)

/* Interruption Not Masked */
#define FS26_FS_FCCU1_M_NOT_MASKED       (0x0000U << FS26_FS_FCCU1_M_SHIFT)
/* Interruption Masked */
#define FS26_FS_FCCU1_M_MASKED           (0x0001U << FS26_FS_FCCU1_M_SHIFT)

/* Interruption Not Masked */
#define FS26_FS_EXT_M_NOT_MASKED         (0x0000U << FS26_FS_EXT_M_SHIFT)
/* Interruption Masked */
#define FS26_FS_EXT_M_MASKED             (0x0001U << FS26_FS_EXT_M_SHIFT)

/* Interruption Not Masked */
#define FS26_FS_REF_M_NOT_MASKED         (0x0000U << FS26_FS_REF_M_SHIFT)
/* Interruption Masked */
#define FS26_FS_REF_M_MASKED             (0x0001U << FS26_FS_REF_M_SHIFT)

/* Interruption Not Masked */
#define FS26_FS_TRK2_M_NOT_MASKED        (0x0000U << FS26_FS_TRK2_M_SHIFT)
/* Interruption Masked */
#define FS26_FS_TRK2_M_MASKED            (0x0001U << FS26_FS_TRK2_M_SHIFT)

/* Interruption Not Masked */
#define FS26_FS_TRK1_M_NOT_MASKED        (0x0000U << FS26_FS_TRK1_M_SHIFT)
/* Interruption Masked */
#define FS26_FS_TRK1_M_MASKED            (0x0001U << FS26_FS_TRK1_M_SHIFT)

/* Interruption Not Masked */
#define FS26_FS_LDO2_M_NOT_MASKED        (0x0000U << FS26_FS_LDO2_M_SHIFT)
/* Interruption Masked */
#define FS26_FS_LDO2_M_MASKED            (0x0001U << FS26_FS_LDO2_M_SHIFT)

/* Interruption Not Masked */
#define FS26_FS_LDO1_M_NOT_MASKED        (0x0000U << FS26_FS_LDO1_M_SHIFT)
/* Interruption Masked */
#define FS26_FS_LDO1_M_MASKED            (0x0001U << FS26_FS_LDO1_M_SHIFT)

/* Interruption Not Masked */
#define FS26_FS_CORE_M_NOT_MASKED        (0x0000U << FS26_FS_CORE_M_SHIFT)
/* Interruption Masked */
#define FS26_FS_CORE_M_MASKED            (0x0001U << FS26_FS_CORE_M_SHIFT)

/* Interruption Not Masked */
#define FS26_FS_VPRE_M_NOT_MASKED        (0x0000U << FS26_FS_VPRE_M_SHIFT)
/* Interruption Masked */
#define FS26_FS_VPRE_M_MASKED            (0x0001U << FS26_FS_VPRE_M_SHIFT)

/******************************************************************************/
/* FS_STATES - Type: RW                                                       */
/******************************************************************************/
#define FS26_FS_STATES_ADDR              0x17U
#define FS26_FS_STATES_DEFAULT           0x0000U

/* Actual State of the Fail Safe State machine */
#define FS26_FS_FS_STATES_MASK           0x001FU
#define FS26_FS_FS_STATES_SHIFT          0x0000U
/* INIT Register Corruption detection */
#define FS26_FS_REG_CORRUPT_MASK         0x0800U
#define FS26_FS_REG_CORRUPT_SHIFT        0x000BU
/* OTP bits corruption detection (5ms cyclic check) */
#define FS26_FS_OTP_CORRUPT_MASK         0x1000U
#define FS26_FS_OTP_CORRUPT_SHIFT        0x000CU
/* DEBUG MODE Status */
#define FS26_FS_DBG_MODE_MASK            0x2000U
#define FS26_FS_DBG_MODE_SHIFT           0x000DU
/* Leave Debug Mode */
#define FS26_FS_EXIT_DBG_MODE_MASK       0x4000U
#define FS26_FS_EXIT_DBG_MODE_SHIFT      0x000EU
/* Test Mode Activation Status */
#define FS26_FS_TM_ACTIVE_MASK           0x8000U
#define FS26_FS_TM_ACTIVE_SHIFT          0x000FU

#define FS26_FS_FS_STATES_0              (0x0000U << FS26_FS_FS_STATES_SHIFT)
#define FS26_FS_FS_STATES_1              (0x0001U << FS26_FS_FS_STATES_SHIFT)

