nxp-appcodehub/dm-power-delivery-frdm-a-s32k344/src/drivers/inc/fs26_map.h
/* No corruption detected in init registers (i.e. no mismatch between register/register_NOT) pair */
#define FS26_FS_REG_CORRUPT_NO_ERROR     (0x0000U << FS26_FS_REG_CORRUPT_SHIFT)
/* Data content corruption detected in init registers (i.e. mismatch between register/register_NOT) pair */
#define FS26_FS_REG_CORRUPT_ERROR        (0x0001U << FS26_FS_REG_CORRUPT_SHIFT)

/* No OTP content CRC error Detected */
#define FS26_FS_OTP_CORRUPT_NO_ERROR     (0x0000U << FS26_FS_OTP_CORRUPT_SHIFT)
/* OTP Content CRC error detected */
#define FS26_FS_OTP_CORRUPT_ERROR        (0x0001U << FS26_FS_OTP_CORRUPT_SHIFT)

/* Not in DEBUG MODE */
#define FS26_FS_DBG_MODE_NOT             (0x0000U << FS26_FS_DBG_MODE_SHIFT)
/* In DEBUG MODE */
#define FS26_FS_DBG_MODE_DEBUG           (0x0001U << FS26_FS_DBG_MODE_SHIFT)

/* No action */
#define FS26_FS_EXIT_DBG_MODE_NO_ACTION  (0x0000U << FS26_FS_EXIT_DBG_MODE_SHIFT)
/* Leave Debug mode */
#define FS26_FS_EXIT_DBG_MODE_LEAVE      (0x0001U << FS26_FS_EXIT_DBG_MODE_SHIFT)

/* Test mode is not activated */
#define FS26_FS_TM_ACTIVE_NOT_ACTIVE     (0x0000U << FS26_FS_TM_ACTIVE_SHIFT)
/* Test mode Activated */
#define FS26_FS_TM_ACTIVE_ACTIVE         (0x0001U << FS26_FS_TM_ACTIVE_SHIFT)

/******************************************************************************/
/* FS_LP_REQ - Type: RW                                                       */
/******************************************************************************/
#define FS26_FS_LP_REQ_ADDR              0x18U
#define FS26_FS_LP_REQ_DEFAULT           0x0000U

/* LOW power command */
#define FS26_FS_FS_LP_REQ_MASK           0x00FFU
#define FS26_FS_FS_LP_REQ_SHIFT          0x0000U

/* Transition to PRE LPOFF */
#define FS26_FS_FS_LP_REQ_PRE_LPOFF      (0x00A5U << FS26_FS_FS_LP_REQ_SHIFT)
/* Transition to FS go LPOFF */
#define FS26_FS_FS_LP_REQ_LPOFF          (0x005AU << FS26_FS_FS_LP_REQ_SHIFT)
/* Transition to PRE STDBY */
#define FS26_FS_FS_LP_REQ_PRE_STANDBY    (0x00AAU << FS26_FS_FS_LP_REQ_SHIFT)
/* Transition to FS go STANDBY */
#define FS26_FS_FS_LP_REQ_STANDBY        (0x0055U << FS26_FS_FS_LP_REQ_SHIFT)

/******************************************************************************/
/* FS_LDT_LPSEL - Type: RW                                                    */
/******************************************************************************/
#define FS26_FS_LDT_LPSEL_ADDR           0x19U
#define FS26_FS_LDT_LPSEL_DEFAULT        0x0000U

/* LOW power command */
#define FS26_FS_LDT_LPSEL_MASK           0x00FFU
#define FS26_FS_LDT_LPSEL_SHIFT          0x0000U

/* Transition to FS go LPOFF when M2FS_ldt_go_lp=1 */
#define FS26_FS_LDT_LPSEL_L              (0x00A5U << FS26_FS_LDT_LPSEL_SHIFT)
/* Transition to FS go STANDBY when M2FS_ldt_go_lp=1 */
#define FS26_FS_LDT_LPSEL_STANDBY        (0x00AAU << FS26_FS_LDT_LPSEL_SHIFT)

#endif /* DRIVERS_FS26_FS26_MAP_H_ */
